zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usart.h
/**
 * \brief Component description for PIC32CZ/CA70 USART
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_USART_COMPONENT_H_
#define _PIC32CZ_CA70_USART_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_USART Universal Synchronous Asynchronous Receiver Transmitter
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR USART */
/* ========================================================================== */

/* -------- US_CR : (USART Offset: 0x00) (/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t RSTRX:1;                   /**< bit:      2  Reset Receiver                                */
    uint32_t RSTTX:1;                   /**< bit:      3  Reset Transmitter                             */
    uint32_t RXEN:1;                    /**< bit:      4  Receiver Enable                               */
    uint32_t RXDIS:1;                   /**< bit:      5  Receiver Disable                              */
    uint32_t TXEN:1;                    /**< bit:      6  Transmitter Enable                            */
    uint32_t TXDIS:1;                   /**< bit:      7  Transmitter Disable                           */
    uint32_t RSTSTA:1;                  /**< bit:      8  Reset Status Bits                             */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  struct
  { // USART mode
    uint32_t :9;                        /**< bit:   0..8  Reserved                                      */
    uint32_t STTBRK:1;                  /**< bit:      9  Start Break                                   */
    uint32_t STPBRK:1;                  /**< bit:     10  Stop Break                                    */
    uint32_t STTTO:1;                   /**< bit:     11  Clear TIMEOUT Flag and Start Timeout After Next Character Received */
    uint32_t SENDA:1;                   /**< bit:     12  Send Address                                  */
    uint32_t RSTIT:1;                   /**< bit:     13  Reset Iterations                              */
    uint32_t RSTNACK:1;                 /**< bit:     14  Reset Non Acknowledge                         */
    uint32_t RETTO:1;                   /**< bit:     15  Start Timeout Immediately                     */
    uint32_t DTREN:1;                   /**< bit:     16  Data Terminal Ready Enable                    */
    uint32_t DTRDIS:1;                  /**< bit:     17  Data Terminal Ready Disable                   */
    uint32_t RTSEN:1;                   /**< bit:     18  Request to Send Enable                        */
    uint32_t RTSDIS:1;                  /**< bit:     19  Request to Send Disable                       */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  { // SPI mode
    uint32_t :18;                       /**< bit:  0..17  Reserved                                      */
    uint32_t FCS:1;                     /**< bit:     18  Force SPI Chip Select                         */
    uint32_t RCS:1;                     /**< bit:     19  Release SPI Chip Select                       */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  { // LIN mode
    uint32_t :20;                       /**< bit:  0..19  Reserved                                      */
    uint32_t LINABT:1;                  /**< bit:     20  Abort LIN Transmission                        */
    uint32_t LINWKUP:1;                 /**< bit:     21  Send LIN Wakeup Signal                        */
    uint32_t :10;                       /**< bit: 22..31  Reserved                                      */
  };
  uint32_t w;
} __US_CR_bits_t;

#define US_CR_RSTRX_Pos                       (2)                                            /**< (US_CR) Reset Receiver Position */
#define US_CR_RSTRX_Msk                       (0x1U << US_CR_RSTRX_Pos)                      /**< (US_CR) Reset Receiver Mask */
#define US_CR_RSTTX_Pos                       (3)                                            /**< (US_CR) Reset Transmitter Position */
#define US_CR_RSTTX_Msk                       (0x1U << US_CR_RSTTX_Pos)                      /**< (US_CR) Reset Transmitter Mask */
#define US_CR_RXEN_Pos                        (4)                                            /**< (US_CR) Receiver Enable Position */
#define US_CR_RXEN_Msk                        (0x1U << US_CR_RXEN_Pos)                       /**< (US_CR) Receiver Enable Mask */
#define US_CR_RXDIS_Pos                       (5)                                            /**< (US_CR) Receiver Disable Position */
#define US_CR_RXDIS_Msk                       (0x1U << US_CR_RXDIS_Pos)                      /**< (US_CR) Receiver Disable Mask */
#define US_CR_TXEN_Pos                        (6)                                            /**< (US_CR) Transmitter Enable Position */
#define US_CR_TXEN_Msk                        (0x1U << US_CR_TXEN_Pos)                       /**< (US_CR) Transmitter Enable Mask */
#define US_CR_TXDIS_Pos                       (7)                                            /**< (US_CR) Transmitter Disable Position */
#define US_CR_TXDIS_Msk                       (0x1U << US_CR_TXDIS_Pos)                      /**< (US_CR) Transmitter Disable Mask */
#define US_CR_RSTSTA_Pos                      (8)                                            /**< (US_CR) Reset Status Bits Position */
#define US_CR_RSTSTA_Msk                      (0x1U << US_CR_RSTSTA_Pos)                     /**< (US_CR) Reset Status Bits Mask */
/* USART mode */
#define US_CR_STTBRK_Pos                      (9)                                            /**< (US_CR) Start Break Position */
#define US_CR_STTBRK_Msk                      (0x1U << US_CR_STTBRK_Pos)                     /**< (US_CR) Start Break Mask */
#define US_CR_STPBRK_Pos                      (10)                                           /**< (US_CR) Stop Break Position */
#define US_CR_STPBRK_Msk                      (0x1U << US_CR_STPBRK_Pos)                     /**< (US_CR) Stop Break Mask */
#define US_CR_STTTO_Pos                       (11)                                           /**< (US_CR) Clear TIMEOUT Flag and Start Timeout After Next Character Received Position */
#define US_CR_STTTO_Msk                       (0x1U << US_CR_STTTO_Pos)                      /**< (US_CR) Clear TIMEOUT Flag and Start Timeout After Next Character Received Mask */
#define US_CR_SENDA_Pos                       (12)                                           /**< (US_CR) Send Address Position */
#define US_CR_SENDA_Msk                       (0x1U << US_CR_SENDA_Pos)                      /**< (US_CR) Send Address Mask */
#define US_CR_RSTIT_Pos                       (13)                                           /**< (US_CR) Reset Iterations Position */
#define US_CR_RSTIT_Msk                       (0x1U << US_CR_RSTIT_Pos)                      /**< (US_CR) Reset Iterations Mask */
#define US_CR_RSTNACK_Pos                     (14)                                           /**< (US_CR) Reset Non Acknowledge Position */
#define US_CR_RSTNACK_Msk                     (0x1U << US_CR_RSTNACK_Pos)                    /**< (US_CR) Reset Non Acknowledge Mask */
#define US_CR_RETTO_Pos                       (15)                                           /**< (US_CR) Start Timeout Immediately Position */
#define US_CR_RETTO_Msk                       (0x1U << US_CR_RETTO_Pos)                      /**< (US_CR) Start Timeout Immediately Mask */
#define US_CR_DTREN_Pos                       (16)                                           /**< (US_CR) Data Terminal Ready Enable Position */
#define US_CR_DTREN_Msk                       (0x1U << US_CR_DTREN_Pos)                      /**< (US_CR) Data Terminal Ready Enable Mask */
#define US_CR_DTRDIS_Pos                      (17)                                           /**< (US_CR) Data Terminal Ready Disable Position */
#define US_CR_DTRDIS_Msk                      (0x1U << US_CR_DTRDIS_Pos)                     /**< (US_CR) Data Terminal Ready Disable Mask */
#define US_CR_RTSEN_Pos                       (18)                                           /**< (US_CR) Request to Send Enable Position */
#define US_CR_RTSEN_Msk                       (0x1U << US_CR_RTSEN_Pos)                      /**< (US_CR) Request to Send Enable Mask */
#define US_CR_RTSDIS_Pos                      (19)                                           /**< (US_CR) Request to Send Disable Position */
#define US_CR_RTSDIS_Msk                      (0x1U << US_CR_RTSDIS_Pos)                     /**< (US_CR) Request to Send Disable Mask */
/* SPI mode */
#define US_CR_FCS_Pos                         (18)                                           /**< (US_CR) Force SPI Chip Select Position */
#define US_CR_FCS_Msk                         (0x1U << US_CR_FCS_Pos)                        /**< (US_CR) Force SPI Chip Select Mask */
#define US_CR_RCS_Pos                         (19)                                           /**< (US_CR) Release SPI Chip Select Position */
#define US_CR_RCS_Msk                         (0x1U << US_CR_RCS_Pos)                        /**< (US_CR) Release SPI Chip Select Mask */
/* LIN mode */
#define US_CR_LINABT_Pos                      (20)                                           /**< (US_CR) Abort LIN Transmission Position */
#define US_CR_LINABT_Msk                      (0x1U << US_CR_LINABT_Pos)                     /**< (US_CR) Abort LIN Transmission Mask */
#define US_CR_LINWKUP_Pos                     (21)                                           /**< (US_CR) Send LIN Wakeup Signal Position */
#define US_CR_LINWKUP_Msk                     (0x1U << US_CR_LINWKUP_Pos)                    /**< (US_CR) Send LIN Wakeup Signal Mask */

/* -------- US_MR : (USART Offset: 0x04) (R/W 32) Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t USART_MODE:4;              /**< bit:   0..3  USART Mode of Operation                       */
    uint32_t USCLKS:2;                  /**< bit:   4..5  Clock Selection                               */
    uint32_t CHRL:2;                    /**< bit:   6..7  Character Length                              */
    uint32_t :10;                       /**< bit:  8..17  Reserved                                      */
    uint32_t CLKO:1;                    /**< bit:     18  Clock Output Select                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  struct
  { // USART mode
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t SYNC:1;                    /**< bit:      8  Synchronous Mode Select                       */
    uint32_t PAR:3;                     /**< bit:  9..11  Parity Type                                   */
    uint32_t NBSTOP:2;                  /**< bit: 12..13  Number of Stop Bits                           */
    uint32_t CHMODE:2;                  /**< bit: 14..15  Channel Mode                                  */
    uint32_t MSBF:1;                    /**< bit:     16  Bit Order                                     */
    uint32_t MODE9:1;                   /**< bit:     17  9-bit Character Length                        */
    uint32_t :1;                        /**< bit:     18  Reserved                                      */
    uint32_t OVER:1;                    /**< bit:     19  Oversampling Mode                             */
    uint32_t INACK:1;                   /**< bit:     20  Inhibit Non Acknowledge                       */
    uint32_t DSNACK:1;                  /**< bit:     21  Disable Successive NACK                       */
    uint32_t VAR_SYNC:1;                /**< bit:     22  Variable Synchronization of Command/Data Sync Start Frame Delimiter */
    uint32_t INVDATA:1;                 /**< bit:     23  Inverted Data                                 */
    uint32_t MAX_ITERATION:3;           /**< bit: 24..26  Maximum Number of Automatic Iteration         */
    uint32_t :1;                        /**< bit:     27  Reserved                                      */
    uint32_t FILTER:1;                  /**< bit:     28  Receive Line Filter                           */
    uint32_t MAN:1;                     /**< bit:     29  Manchester Encoder/Decoder Enable             */
    uint32_t MODSYNC:1;                 /**< bit:     30  Manchester Synchronization Mode               */
    uint32_t ONEBIT:1;                  /**< bit:     31  Start Frame Delimiter Selector                */
  };
  struct
  { // SPI mode
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t CPHA:1;                    /**< bit:      8  SPI Clock Phase                               */
    uint32_t :7;                        /**< bit:  9..15  Reserved                                      */
    uint32_t CPOL:1;                    /**< bit:     16  SPI Clock Polarity                            */
    uint32_t :3;                        /**< bit: 17..19  Reserved                                      */
    uint32_t WRDBT:1;                   /**< bit:     20  Wait Read Data Before Transfer                */
    uint32_t :11;                       /**< bit: 21..31  Reserved                                      */
  };
  uint32_t w;
} __US_MR_bits_t;

