zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usart.h
/* -------- US_IER : (USART Offset: 0x08) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t RXRDY:1;                   /**< bit:      0  RXRDY Interrupt Enable                        */
    uint32_t TXRDY:1;                   /**< bit:      1  TXRDY Interrupt Enable                        */
    uint32_t :3;                        /**< bit:   2..4  Reserved                                      */
    uint32_t OVRE:1;                    /**< bit:      5  Overrun Error Interrupt Enable                */
    uint32_t :3;                        /**< bit:   6..8  Reserved                                      */
    uint32_t TXEMPTY:1;                 /**< bit:      9  TXEMPTY Interrupt Enable                      */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  struct
  { // USART mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t RXBRK:1;                   /**< bit:      2  Receiver Break Interrupt Enable               */
    uint32_t :7;                        /**< bit:   3..9  Reserved                                      */
    uint32_t ITER:1;                    /**< bit:     10  Max number of Repetitions Reached Interrupt Enable */
    uint32_t :2;                        /**< bit: 11..12  Reserved                                      */
    uint32_t NACK:1;                    /**< bit:     13  Non Acknowledge Interrupt Enable              */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t RIIC:1;                    /**< bit:     16  Ring Indicator Input Change Enable            */
    uint32_t DSRIC:1;                   /**< bit:     17  Data Set Ready Input Change Enable            */
    uint32_t DCDIC:1;                   /**< bit:     18  Data Carrier Detect Input Change Interrupt Enable */
    uint32_t CTSIC:1;                   /**< bit:     19  Clear to Send Input Change Interrupt Enable   */
    uint32_t :4;                        /**< bit: 20..23  Reserved                                      */
    uint32_t MANE:1;                    /**< bit:     24  Manchester Error Interrupt Enable             */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  struct
  { // USART and LIN mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t FRAME:1;                   /**< bit:      6  Framing Error Interrupt Enable                */
    uint32_t PARE:1;                    /**< bit:      7  Parity Error Interrupt Enable                 */
    uint32_t TIMEOUT:1;                 /**< bit:      8  Timeout Interrupt Enable                      */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  struct
  { // SPI mode
    uint32_t :19;                       /**< bit:  0..18  Reserved                                      */
    uint32_t NSSE:1;                    /**< bit:     19  NSS Line (Driving CTS Pin) Rising or Falling Edge Event */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  { // LIN mode
    uint32_t :13;                       /**< bit:  0..12  Reserved                                      */
    uint32_t LINBK:1;                   /**< bit:     13  LIN Break Sent or LIN Break Received Interrupt Enable */
    uint32_t LINID:1;                   /**< bit:     14  LIN Identifier Sent or LIN Identifier Received Interrupt Enable */
    uint32_t LINTC:1;                   /**< bit:     15  LIN Transfer Completed Interrupt Enable       */
    uint32_t :9;                        /**< bit: 16..24  Reserved                                      */
    uint32_t LINBE:1;                   /**< bit:     25  LIN Bus Error Interrupt Enable                */
    uint32_t LINISFE:1;                 /**< bit:     26  LIN Inconsistent Synch Field Error Interrupt Enable */
    uint32_t LINIPE:1;                  /**< bit:     27  LIN Identifier Parity Interrupt Enable        */
    uint32_t LINCE:1;                   /**< bit:     28  LIN Checksum Error Interrupt Enable           */
    uint32_t LINSNRE:1;                 /**< bit:     29  LIN Slave Not Responding Error Interrupt Enable */
    uint32_t LINSTE:1;                  /**< bit:     30  LIN Synch Tolerance Error Interrupt Enable    */
    uint32_t LINHTE:1;                  /**< bit:     31  LIN Header Timeout Error Interrupt Enable     */
  };
  struct
  { // LON mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t LSFE:1;                    /**< bit:      6  LON Short Frame Error Interrupt Enable        */
    uint32_t LCRCE:1;                   /**< bit:      7  LON CRC Error Interrupt Enable                */
    uint32_t :16;                       /**< bit:  8..23  Reserved                                      */
    uint32_t LTXD:1;                    /**< bit:     24  LON Transmission Done Interrupt Enable        */
    uint32_t LCOL:1;                    /**< bit:     25  LON Collision Interrupt Enable                */
    uint32_t LFET:1;                    /**< bit:     26  LON Frame Early Termination Interrupt Enable  */
    uint32_t LRXD:1;                    /**< bit:     27  LON Reception Done Interrupt Enable           */
    uint32_t LBLOVFE:1;                 /**< bit:     28  LON Backlog Overflow Error Interrupt Enable   */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  struct
  { // LON and SPI mode mode
    uint32_t :10;                       /**< bit:   0..9  Reserved                                      */
    uint32_t UNRE:1;                    /**< bit:     10  Underrun Error Interrupt Enable               */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __US_IER_bits_t;

#define US_IER_RXRDY_Pos                      (0)                                            /**< (US_IER) RXRDY Interrupt Enable Position */
#define US_IER_RXRDY_Msk                      (0x1U << US_IER_RXRDY_Pos)                     /**< (US_IER) RXRDY Interrupt Enable Mask */
#define US_IER_TXRDY_Pos                      (1)                                            /**< (US_IER) TXRDY Interrupt Enable Position */
#define US_IER_TXRDY_Msk                      (0x1U << US_IER_TXRDY_Pos)                     /**< (US_IER) TXRDY Interrupt Enable Mask */
#define US_IER_OVRE_Pos                       (5)                                            /**< (US_IER) Overrun Error Interrupt Enable Position */
#define US_IER_OVRE_Msk                       (0x1U << US_IER_OVRE_Pos)                      /**< (US_IER) Overrun Error Interrupt Enable Mask */
#define US_IER_TXEMPTY_Pos                    (9)                                            /**< (US_IER) TXEMPTY Interrupt Enable Position */
#define US_IER_TXEMPTY_Msk                    (0x1U << US_IER_TXEMPTY_Pos)                   /**< (US_IER) TXEMPTY Interrupt Enable Mask */
/* USART mode */
#define US_IER_RXBRK_Pos                      (2)                                            /**< (US_IER) Receiver Break Interrupt Enable Position */
#define US_IER_RXBRK_Msk                      (0x1U << US_IER_RXBRK_Pos)                     /**< (US_IER) Receiver Break Interrupt Enable Mask */
#define US_IER_ITER_Pos                       (10)                                           /**< (US_IER) Max number of Repetitions Reached Interrupt Enable Position */
#define US_IER_ITER_Msk                       (0x1U << US_IER_ITER_Pos)                      /**< (US_IER) Max number of Repetitions Reached Interrupt Enable Mask */
#define US_IER_NACK_Pos                       (13)                                           /**< (US_IER) Non Acknowledge Interrupt Enable Position */
#define US_IER_NACK_Msk                       (0x1U << US_IER_NACK_Pos)                      /**< (US_IER) Non Acknowledge Interrupt Enable Mask */
#define US_IER_RIIC_Pos                       (16)                                           /**< (US_IER) Ring Indicator Input Change Enable Position */
#define US_IER_RIIC_Msk                       (0x1U << US_IER_RIIC_Pos)                      /**< (US_IER) Ring Indicator Input Change Enable Mask */
#define US_IER_DSRIC_Pos                      (17)                                           /**< (US_IER) Data Set Ready Input Change Enable Position */
#define US_IER_DSRIC_Msk                      (0x1U << US_IER_DSRIC_Pos)                     /**< (US_IER) Data Set Ready Input Change Enable Mask */
#define US_IER_DCDIC_Pos                      (18)                                           /**< (US_IER) Data Carrier Detect Input Change Interrupt Enable Position */
#define US_IER_DCDIC_Msk                      (0x1U << US_IER_DCDIC_Pos)                     /**< (US_IER) Data Carrier Detect Input Change Interrupt Enable Mask */
#define US_IER_CTSIC_Pos                      (19)                                           /**< (US_IER) Clear to Send Input Change Interrupt Enable Position */
#define US_IER_CTSIC_Msk                      (0x1U << US_IER_CTSIC_Pos)                     /**< (US_IER) Clear to Send Input Change Interrupt Enable Mask */
#define US_IER_MANE_Pos                       (24)                                           /**< (US_IER) Manchester Error Interrupt Enable Position */
#define US_IER_MANE_Msk                       (0x1U << US_IER_MANE_Pos)                      /**< (US_IER) Manchester Error Interrupt Enable Mask */
/* USART and LIN mode */
#define US_IER_FRAME_Pos                      (6)                                            /**< (US_IER) Framing Error Interrupt Enable Position */
#define US_IER_FRAME_Msk                      (0x1U << US_IER_FRAME_Pos)                     /**< (US_IER) Framing Error Interrupt Enable Mask */
#define US_IER_PARE_Pos                       (7)                                            /**< (US_IER) Parity Error Interrupt Enable Position */
#define US_IER_PARE_Msk                       (0x1U << US_IER_PARE_Pos)                      /**< (US_IER) Parity Error Interrupt Enable Mask */
#define US_IER_TIMEOUT_Pos                    (8)                                            /**< (US_IER) Timeout Interrupt Enable Position */
#define US_IER_TIMEOUT_Msk                    (0x1U << US_IER_TIMEOUT_Pos)                   /**< (US_IER) Timeout Interrupt Enable Mask */
/* SPI mode */
#define US_IER_NSSE_Pos                       (19)                                           /**< (US_IER) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_IER_NSSE_Msk                       (0x1U << US_IER_NSSE_Pos)                      /**< (US_IER) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
/* LIN mode */
#define US_IER_LINBK_Pos                      (13)                                           /**< (US_IER) LIN Break Sent or LIN Break Received Interrupt Enable Position */
#define US_IER_LINBK_Msk                      (0x1U << US_IER_LINBK_Pos)                     /**< (US_IER) LIN Break Sent or LIN Break Received Interrupt Enable Mask */
#define US_IER_LINID_Pos                      (14)                                           /**< (US_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable Position */
#define US_IER_LINID_Msk                      (0x1U << US_IER_LINID_Pos)                     /**< (US_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable Mask */
#define US_IER_LINTC_Pos                      (15)                                           /**< (US_IER) LIN Transfer Completed Interrupt Enable Position */
#define US_IER_LINTC_Msk                      (0x1U << US_IER_LINTC_Pos)                     /**< (US_IER) LIN Transfer Completed Interrupt Enable Mask */
#define US_IER_LINBE_Pos                      (25)                                           /**< (US_IER) LIN Bus Error Interrupt Enable Position */
#define US_IER_LINBE_Msk                      (0x1U << US_IER_LINBE_Pos)                     /**< (US_IER) LIN Bus Error Interrupt Enable Mask */
#define US_IER_LINISFE_Pos                    (26)                                           /**< (US_IER) LIN Inconsistent Synch Field Error Interrupt Enable Position */
#define US_IER_LINISFE_Msk                    (0x1U << US_IER_LINISFE_Pos)                   /**< (US_IER) LIN Inconsistent Synch Field Error Interrupt Enable Mask */
#define US_IER_LINIPE_Pos                     (27)                                           /**< (US_IER) LIN Identifier Parity Interrupt Enable Position */
#define US_IER_LINIPE_Msk                     (0x1U << US_IER_LINIPE_Pos)                    /**< (US_IER) LIN Identifier Parity Interrupt Enable Mask */
#define US_IER_LINCE_Pos                      (28)                                           /**< (US_IER) LIN Checksum Error Interrupt Enable Position */
#define US_IER_LINCE_Msk                      (0x1U << US_IER_LINCE_Pos)                     /**< (US_IER) LIN Checksum Error Interrupt Enable Mask */
#define US_IER_LINSNRE_Pos                    (29)                                           /**< (US_IER) LIN Slave Not Responding Error Interrupt Enable Position */
#define US_IER_LINSNRE_Msk                    (0x1U << US_IER_LINSNRE_Pos)                   /**< (US_IER) LIN Slave Not Responding Error Interrupt Enable Mask */
#define US_IER_LINSTE_Pos                     (30)                                           /**< (US_IER) LIN Synch Tolerance Error Interrupt Enable Position */
#define US_IER_LINSTE_Msk                     (0x1U << US_IER_LINSTE_Pos)                    /**< (US_IER) LIN Synch Tolerance Error Interrupt Enable Mask */
#define US_IER_LINHTE_Pos                     (31)                                           /**< (US_IER) LIN Header Timeout Error Interrupt Enable Position */
#define US_IER_LINHTE_Msk                     (0x1U << US_IER_LINHTE_Pos)                    /**< (US_IER) LIN Header Timeout Error Interrupt Enable Mask */
/* LON mode */
#define US_IER_LSFE_Pos                       (6)                                            /**< (US_IER) LON Short Frame Error Interrupt Enable Position */
#define US_IER_LSFE_Msk                       (0x1U << US_IER_LSFE_Pos)                      /**< (US_IER) LON Short Frame Error Interrupt Enable Mask */
#define US_IER_LCRCE_Pos                      (7)                                            /**< (US_IER) LON CRC Error Interrupt Enable Position */
#define US_IER_LCRCE_Msk                      (0x1U << US_IER_LCRCE_Pos)                     /**< (US_IER) LON CRC Error Interrupt Enable Mask */
#define US_IER_LTXD_Pos                       (24)                                           /**< (US_IER) LON Transmission Done Interrupt Enable Position */
#define US_IER_LTXD_Msk                       (0x1U << US_IER_LTXD_Pos)                      /**< (US_IER) LON Transmission Done Interrupt Enable Mask */
#define US_IER_LCOL_Pos                       (25)                                           /**< (US_IER) LON Collision Interrupt Enable Position */
#define US_IER_LCOL_Msk                       (0x1U << US_IER_LCOL_Pos)                      /**< (US_IER) LON Collision Interrupt Enable Mask */
#define US_IER_LFET_Pos                       (26)                                           /**< (US_IER) LON Frame Early Termination Interrupt Enable Position */
#define US_IER_LFET_Msk                       (0x1U << US_IER_LFET_Pos)                      /**< (US_IER) LON Frame Early Termination Interrupt Enable Mask */
#define US_IER_LRXD_Pos                       (27)                                           /**< (US_IER) LON Reception Done Interrupt Enable Position */
#define US_IER_LRXD_Msk                       (0x1U << US_IER_LRXD_Pos)                      /**< (US_IER) LON Reception Done Interrupt Enable Mask */
#define US_IER_LBLOVFE_Pos                    (28)                                           /**< (US_IER) LON Backlog Overflow Error Interrupt Enable Position */
#define US_IER_LBLOVFE_Msk                    (0x1U << US_IER_LBLOVFE_Pos)                   /**< (US_IER) LON Backlog Overflow Error Interrupt Enable Mask */
/* LON and SPI mode mode */
#define US_IER_UNRE_Pos                       (10)                                           /**< (US_IER) Underrun Error Interrupt Enable Position */
#define US_IER_UNRE_Msk                       (0x1U << US_IER_UNRE_Pos)                      /**< (US_IER) Underrun Error Interrupt Enable Mask */

