zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usart.h
/* -------- US_IDR : (USART Offset: 0x0c) (/W 32) Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t RXRDY:1;                   /**< bit:      0  RXRDY Interrupt Disable                       */
    uint32_t TXRDY:1;                   /**< bit:      1  TXRDY Interrupt Disable                       */
    uint32_t :3;                        /**< bit:   2..4  Reserved                                      */
    uint32_t OVRE:1;                    /**< bit:      5  Overrun Error Interrupt Enable                */
    uint32_t :3;                        /**< bit:   6..8  Reserved                                      */
    uint32_t TXEMPTY:1;                 /**< bit:      9  TXEMPTY Interrupt Disable                     */
    uint32_t :6;                        /**< bit: 10..15  Reserved                                      */
    uint32_t RIIC:1;                    /**< bit:     16  Ring Indicator Input Change Disable           */
    uint32_t DSRIC:1;                   /**< bit:     17  Data Set Ready Input Change Disable           */
    uint32_t DCDIC:1;                   /**< bit:     18  Data Carrier Detect Input Change Interrupt Disable */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  struct
  { // USART mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t RXBRK:1;                   /**< bit:      2  Receiver Break Interrupt Disable              */
    uint32_t :7;                        /**< bit:   3..9  Reserved                                      */
    uint32_t ITER:1;                    /**< bit:     10  Max Number of Repetitions Reached Interrupt Disable */
    uint32_t :2;                        /**< bit: 11..12  Reserved                                      */
    uint32_t NACK:1;                    /**< bit:     13  Non Acknowledge Interrupt Disable             */
    uint32_t :5;                        /**< bit: 14..18  Reserved                                      */
    uint32_t CTSIC:1;                   /**< bit:     19  Clear to Send Input Change Interrupt Disable  */
    uint32_t :4;                        /**< bit: 20..23  Reserved                                      */
    uint32_t MANE:1;                    /**< bit:     24  Manchester Error Interrupt Disable            */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  struct
  { // USART and LIN mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t FRAME:1;                   /**< bit:      6  Framing Error Interrupt Disable               */
    uint32_t PARE:1;                    /**< bit:      7  Parity Error Interrupt Disable                */
    uint32_t TIMEOUT:1;                 /**< bit:      8  Timeout Interrupt Disable                     */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  struct
  { // SPI mode
    uint32_t :19;                       /**< bit:  0..18  Reserved                                      */
    uint32_t NSSE:1;                    /**< bit:     19  NSS Line (Driving CTS Pin) Rising or Falling Edge Event */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  { // LIN mode
    uint32_t :13;                       /**< bit:  0..12  Reserved                                      */
    uint32_t LINBK:1;                   /**< bit:     13  LIN Break Sent or LIN Break Received Interrupt Disable */
    uint32_t LINID:1;                   /**< bit:     14  LIN Identifier Sent or LIN Identifier Received Interrupt Disable */
    uint32_t LINTC:1;                   /**< bit:     15  LIN Transfer Completed Interrupt Disable      */
    uint32_t :9;                        /**< bit: 16..24  Reserved                                      */
    uint32_t LINBE:1;                   /**< bit:     25  LIN Bus Error Interrupt Disable               */
    uint32_t LINISFE:1;                 /**< bit:     26  LIN Inconsistent Synch Field Error Interrupt Disable */
    uint32_t LINIPE:1;                  /**< bit:     27  LIN Identifier Parity Interrupt Disable       */
    uint32_t LINCE:1;                   /**< bit:     28  LIN Checksum Error Interrupt Disable          */
    uint32_t LINSNRE:1;                 /**< bit:     29  LIN Slave Not Responding Error Interrupt Disable */
    uint32_t LINSTE:1;                  /**< bit:     30  LIN Synch Tolerance Error Interrupt Disable   */
    uint32_t LINHTE:1;                  /**< bit:     31  LIN Header Timeout Error Interrupt Disable    */
  };
  struct
  { // LON mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t LSFE:1;                    /**< bit:      6  LON Short Frame Error Interrupt Disable       */
    uint32_t LCRCE:1;                   /**< bit:      7  LON CRC Error Interrupt Disable               */
    uint32_t :16;                       /**< bit:  8..23  Reserved                                      */
    uint32_t LTXD:1;                    /**< bit:     24  LON Transmission Done Interrupt Disable       */
    uint32_t LCOL:1;                    /**< bit:     25  LON Collision Interrupt Disable               */
    uint32_t LFET:1;                    /**< bit:     26  LON Frame Early Termination Interrupt Disable */
    uint32_t LRXD:1;                    /**< bit:     27  LON Reception Done Interrupt Disable          */
    uint32_t LBLOVFE:1;                 /**< bit:     28  LON Backlog Overflow Error Interrupt Disable  */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  struct
  { // LON and SPI mode mode
    uint32_t :10;                       /**< bit:   0..9  Reserved                                      */
    uint32_t UNRE:1;                    /**< bit:     10  SPI Underrun Error Interrupt Disable          */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __US_IDR_bits_t;

#define US_IDR_RXRDY_Pos                      (0)                                            /**< (US_IDR) RXRDY Interrupt Disable Position */
#define US_IDR_RXRDY_Msk                      (0x1U << US_IDR_RXRDY_Pos)                     /**< (US_IDR) RXRDY Interrupt Disable Mask */
#define US_IDR_TXRDY_Pos                      (1)                                            /**< (US_IDR) TXRDY Interrupt Disable Position */
#define US_IDR_TXRDY_Msk                      (0x1U << US_IDR_TXRDY_Pos)                     /**< (US_IDR) TXRDY Interrupt Disable Mask */
#define US_IDR_OVRE_Pos                       (5)                                            /**< (US_IDR) Overrun Error Interrupt Enable Position */
#define US_IDR_OVRE_Msk                       (0x1U << US_IDR_OVRE_Pos)                      /**< (US_IDR) Overrun Error Interrupt Enable Mask */
#define US_IDR_TXEMPTY_Pos                    (9)                                            /**< (US_IDR) TXEMPTY Interrupt Disable Position */
#define US_IDR_TXEMPTY_Msk                    (0x1U << US_IDR_TXEMPTY_Pos)                   /**< (US_IDR) TXEMPTY Interrupt Disable Mask */
#define US_IDR_RIIC_Pos                       (16)                                           /**< (US_IDR) Ring Indicator Input Change Disable Position */
#define US_IDR_RIIC_Msk                       (0x1U << US_IDR_RIIC_Pos)                      /**< (US_IDR) Ring Indicator Input Change Disable Mask */
#define US_IDR_DSRIC_Pos                      (17)                                           /**< (US_IDR) Data Set Ready Input Change Disable Position */
#define US_IDR_DSRIC_Msk                      (0x1U << US_IDR_DSRIC_Pos)                     /**< (US_IDR) Data Set Ready Input Change Disable Mask */
#define US_IDR_DCDIC_Pos                      (18)                                           /**< (US_IDR) Data Carrier Detect Input Change Interrupt Disable Position */
#define US_IDR_DCDIC_Msk                      (0x1U << US_IDR_DCDIC_Pos)                     /**< (US_IDR) Data Carrier Detect Input Change Interrupt Disable Mask */
/* USART mode */
#define US_IDR_RXBRK_Pos                      (2)                                            /**< (US_IDR) Receiver Break Interrupt Disable Position */
#define US_IDR_RXBRK_Msk                      (0x1U << US_IDR_RXBRK_Pos)                     /**< (US_IDR) Receiver Break Interrupt Disable Mask */
#define US_IDR_ITER_Pos                       (10)                                           /**< (US_IDR) Max Number of Repetitions Reached Interrupt Disable Position */
#define US_IDR_ITER_Msk                       (0x1U << US_IDR_ITER_Pos)                      /**< (US_IDR) Max Number of Repetitions Reached Interrupt Disable Mask */
#define US_IDR_NACK_Pos                       (13)                                           /**< (US_IDR) Non Acknowledge Interrupt Disable Position */
#define US_IDR_NACK_Msk                       (0x1U << US_IDR_NACK_Pos)                      /**< (US_IDR) Non Acknowledge Interrupt Disable Mask */
#define US_IDR_CTSIC_Pos                      (19)                                           /**< (US_IDR) Clear to Send Input Change Interrupt Disable Position */
#define US_IDR_CTSIC_Msk                      (0x1U << US_IDR_CTSIC_Pos)                     /**< (US_IDR) Clear to Send Input Change Interrupt Disable Mask */
#define US_IDR_MANE_Pos                       (24)                                           /**< (US_IDR) Manchester Error Interrupt Disable Position */
#define US_IDR_MANE_Msk                       (0x1U << US_IDR_MANE_Pos)                      /**< (US_IDR) Manchester Error Interrupt Disable Mask */
/* USART and LIN mode */
#define US_IDR_FRAME_Pos                      (6)                                            /**< (US_IDR) Framing Error Interrupt Disable Position */
#define US_IDR_FRAME_Msk                      (0x1U << US_IDR_FRAME_Pos)                     /**< (US_IDR) Framing Error Interrupt Disable Mask */
#define US_IDR_PARE_Pos                       (7)                                            /**< (US_IDR) Parity Error Interrupt Disable Position */
#define US_IDR_PARE_Msk                       (0x1U << US_IDR_PARE_Pos)                      /**< (US_IDR) Parity Error Interrupt Disable Mask */
#define US_IDR_TIMEOUT_Pos                    (8)                                            /**< (US_IDR) Timeout Interrupt Disable Position */
#define US_IDR_TIMEOUT_Msk                    (0x1U << US_IDR_TIMEOUT_Pos)                   /**< (US_IDR) Timeout Interrupt Disable Mask */
/* SPI mode */
#define US_IDR_NSSE_Pos                       (19)                                           /**< (US_IDR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_IDR_NSSE_Msk                       (0x1U << US_IDR_NSSE_Pos)                      /**< (US_IDR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
/* LIN mode */
#define US_IDR_LINBK_Pos                      (13)                                           /**< (US_IDR) LIN Break Sent or LIN Break Received Interrupt Disable Position */
#define US_IDR_LINBK_Msk                      (0x1U << US_IDR_LINBK_Pos)                     /**< (US_IDR) LIN Break Sent or LIN Break Received Interrupt Disable Mask */
#define US_IDR_LINID_Pos                      (14)                                           /**< (US_IDR) LIN Identifier Sent or LIN Identifier Received Interrupt Disable Position */
#define US_IDR_LINID_Msk                      (0x1U << US_IDR_LINID_Pos)                     /**< (US_IDR) LIN Identifier Sent or LIN Identifier Received Interrupt Disable Mask */
#define US_IDR_LINTC_Pos                      (15)                                           /**< (US_IDR) LIN Transfer Completed Interrupt Disable Position */
#define US_IDR_LINTC_Msk                      (0x1U << US_IDR_LINTC_Pos)                     /**< (US_IDR) LIN Transfer Completed Interrupt Disable Mask */
#define US_IDR_LINBE_Pos                      (25)                                           /**< (US_IDR) LIN Bus Error Interrupt Disable Position */
#define US_IDR_LINBE_Msk                      (0x1U << US_IDR_LINBE_Pos)                     /**< (US_IDR) LIN Bus Error Interrupt Disable Mask */
#define US_IDR_LINISFE_Pos                    (26)                                           /**< (US_IDR) LIN Inconsistent Synch Field Error Interrupt Disable Position */
#define US_IDR_LINISFE_Msk                    (0x1U << US_IDR_LINISFE_Pos)                   /**< (US_IDR) LIN Inconsistent Synch Field Error Interrupt Disable Mask */
#define US_IDR_LINIPE_Pos                     (27)                                           /**< (US_IDR) LIN Identifier Parity Interrupt Disable Position */
#define US_IDR_LINIPE_Msk                     (0x1U << US_IDR_LINIPE_Pos)                    /**< (US_IDR) LIN Identifier Parity Interrupt Disable Mask */
#define US_IDR_LINCE_Pos                      (28)                                           /**< (US_IDR) LIN Checksum Error Interrupt Disable Position */
#define US_IDR_LINCE_Msk                      (0x1U << US_IDR_LINCE_Pos)                     /**< (US_IDR) LIN Checksum Error Interrupt Disable Mask */
#define US_IDR_LINSNRE_Pos                    (29)                                           /**< (US_IDR) LIN Slave Not Responding Error Interrupt Disable Position */
#define US_IDR_LINSNRE_Msk                    (0x1U << US_IDR_LINSNRE_Pos)                   /**< (US_IDR) LIN Slave Not Responding Error Interrupt Disable Mask */
#define US_IDR_LINSTE_Pos                     (30)                                           /**< (US_IDR) LIN Synch Tolerance Error Interrupt Disable Position */
#define US_IDR_LINSTE_Msk                     (0x1U << US_IDR_LINSTE_Pos)                    /**< (US_IDR) LIN Synch Tolerance Error Interrupt Disable Mask */
#define US_IDR_LINHTE_Pos                     (31)                                           /**< (US_IDR) LIN Header Timeout Error Interrupt Disable Position */
#define US_IDR_LINHTE_Msk                     (0x1U << US_IDR_LINHTE_Pos)                    /**< (US_IDR) LIN Header Timeout Error Interrupt Disable Mask */
/* LON mode */
#define US_IDR_LSFE_Pos                       (6)                                            /**< (US_IDR) LON Short Frame Error Interrupt Disable Position */
#define US_IDR_LSFE_Msk                       (0x1U << US_IDR_LSFE_Pos)                      /**< (US_IDR) LON Short Frame Error Interrupt Disable Mask */
#define US_IDR_LCRCE_Pos                      (7)                                            /**< (US_IDR) LON CRC Error Interrupt Disable Position */
#define US_IDR_LCRCE_Msk                      (0x1U << US_IDR_LCRCE_Pos)                     /**< (US_IDR) LON CRC Error Interrupt Disable Mask */
#define US_IDR_LTXD_Pos                       (24)                                           /**< (US_IDR) LON Transmission Done Interrupt Disable Position */
#define US_IDR_LTXD_Msk                       (0x1U << US_IDR_LTXD_Pos)                      /**< (US_IDR) LON Transmission Done Interrupt Disable Mask */
#define US_IDR_LCOL_Pos                       (25)                                           /**< (US_IDR) LON Collision Interrupt Disable Position */
#define US_IDR_LCOL_Msk                       (0x1U << US_IDR_LCOL_Pos)                      /**< (US_IDR) LON Collision Interrupt Disable Mask */
#define US_IDR_LFET_Pos                       (26)                                           /**< (US_IDR) LON Frame Early Termination Interrupt Disable Position */
#define US_IDR_LFET_Msk                       (0x1U << US_IDR_LFET_Pos)                      /**< (US_IDR) LON Frame Early Termination Interrupt Disable Mask */
#define US_IDR_LRXD_Pos                       (27)                                           /**< (US_IDR) LON Reception Done Interrupt Disable Position */
#define US_IDR_LRXD_Msk                       (0x1U << US_IDR_LRXD_Pos)                      /**< (US_IDR) LON Reception Done Interrupt Disable Mask */
#define US_IDR_LBLOVFE_Pos                    (28)                                           /**< (US_IDR) LON Backlog Overflow Error Interrupt Disable Position */
#define US_IDR_LBLOVFE_Msk                    (0x1U << US_IDR_LBLOVFE_Pos)                   /**< (US_IDR) LON Backlog Overflow Error Interrupt Disable Mask */
/* LON and SPI mode mode */
#define US_IDR_UNRE_Pos                       (10)                                           /**< (US_IDR) SPI Underrun Error Interrupt Disable Position */
#define US_IDR_UNRE_Msk                       (0x1U << US_IDR_UNRE_Pos)                      /**< (US_IDR) SPI Underrun Error Interrupt Disable Mask */

/* -------- US_IMR : (USART Offset: 0x10) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t RXRDY:1;                   /**< bit:      0  RXRDY Interrupt Mask                          */
    uint32_t TXRDY:1;                   /**< bit:      1  TXRDY Interrupt Mask                          */
    uint32_t :3;                        /**< bit:   2..4  Reserved                                      */
    uint32_t OVRE:1;                    /**< bit:      5  Overrun Error Interrupt Mask                  */
    uint32_t :3;                        /**< bit:   6..8  Reserved                                      */
    uint32_t TXEMPTY:1;                 /**< bit:      9  TXEMPTY Interrupt Mask                        */
    uint32_t :6;                        /**< bit: 10..15  Reserved                                      */
    uint32_t RIIC:1;                    /**< bit:     16  Ring Indicator Input Change Mask              */
    uint32_t DSRIC:1;                   /**< bit:     17  Data Set Ready Input Change Mask              */
    uint32_t DCDIC:1;                   /**< bit:     18  Data Carrier Detect Input Change Interrupt Mask */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  struct
  { // USART mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t RXBRK:1;                   /**< bit:      2  Receiver Break Interrupt Mask                 */
    uint32_t :7;                        /**< bit:   3..9  Reserved                                      */
    uint32_t ITER:1;                    /**< bit:     10  Max Number of Repetitions Reached Interrupt Mask */
    uint32_t :2;                        /**< bit: 11..12  Reserved                                      */
    uint32_t NACK:1;                    /**< bit:     13  Non Acknowledge Interrupt Mask                */
    uint32_t :5;                        /**< bit: 14..18  Reserved                                      */
    uint32_t CTSIC:1;                   /**< bit:     19  Clear to Send Input Change Interrupt Mask     */
    uint32_t :4;                        /**< bit: 20..23  Reserved                                      */
    uint32_t MANE:1;                    /**< bit:     24  Manchester Error Interrupt Mask               */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  struct
  { // USART and LIN mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t FRAME:1;                   /**< bit:      6  Framing Error Interrupt Mask                  */
    uint32_t PARE:1;                    /**< bit:      7  Parity Error Interrupt Mask                   */
    uint32_t TIMEOUT:1;                 /**< bit:      8  Timeout Interrupt Mask                        */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  struct
  { // SPI mode
    uint32_t :19;                       /**< bit:  0..18  Reserved                                      */
    uint32_t NSSE:1;                    /**< bit:     19  NSS Line (Driving CTS Pin) Rising or Falling Edge Event */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  { // LIN mode
    uint32_t :13;                       /**< bit:  0..12  Reserved                                      */
    uint32_t LINBK:1;                   /**< bit:     13  LIN Break Sent or LIN Break Received Interrupt Mask */
    uint32_t LINID:1;                   /**< bit:     14  LIN Identifier Sent or LIN Identifier Received Interrupt Mask */
    uint32_t LINTC:1;                   /**< bit:     15  LIN Transfer Completed Interrupt Mask         */
    uint32_t :9;                        /**< bit: 16..24  Reserved                                      */
    uint32_t LINBE:1;                   /**< bit:     25  LIN Bus Error Interrupt Mask                  */
    uint32_t LINISFE:1;                 /**< bit:     26  LIN Inconsistent Synch Field Error Interrupt Mask */
    uint32_t LINIPE:1;                  /**< bit:     27  LIN Identifier Parity Interrupt Mask          */
    uint32_t LINCE:1;                   /**< bit:     28  LIN Checksum Error Interrupt Mask             */
    uint32_t LINSNRE:1;                 /**< bit:     29  LIN Slave Not Responding Error Interrupt Mask */
    uint32_t LINSTE:1;                  /**< bit:     30  LIN Synch Tolerance Error Interrupt Mask      */
    uint32_t LINHTE:1;                  /**< bit:     31  LIN Header Timeout Error Interrupt Mask       */
  };
  struct
  { // LON mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t LSFE:1;                    /**< bit:      6  LON Short Frame Error Interrupt Mask          */
    uint32_t LCRCE:1;                   /**< bit:      7  LON CRC Error Interrupt Mask                  */
    uint32_t :16;                       /**< bit:  8..23  Reserved                                      */
    uint32_t LTXD:1;                    /**< bit:     24  LON Transmission Done Interrupt Mask          */
    uint32_t LCOL:1;                    /**< bit:     25  LON Collision Interrupt Mask                  */
    uint32_t LFET:1;                    /**< bit:     26  LON Frame Early Termination Interrupt Mask    */
    uint32_t LRXD:1;                    /**< bit:     27  LON Reception Done Interrupt Mask             */
    uint32_t LBLOVFE:1;                 /**< bit:     28  LON Backlog Overflow Error Interrupt Mask     */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  struct
  { // LON and SPI mode
    uint32_t :10;                       /**< bit:   0..9  Reserved                                      */
    uint32_t UNRE:1;                    /**< bit:     10  SPI Underrun Error Interrupt Mask             */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __US_IMR_bits_t;

