zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usart.h
#define US_IMR_RXRDY_Pos                      (0)                                            /**< (US_IMR) RXRDY Interrupt Mask Position */
#define US_IMR_RXRDY_Msk                      (0x1U << US_IMR_RXRDY_Pos)                     /**< (US_IMR) RXRDY Interrupt Mask Mask */
#define US_IMR_TXRDY_Pos                      (1)                                            /**< (US_IMR) TXRDY Interrupt Mask Position */
#define US_IMR_TXRDY_Msk                      (0x1U << US_IMR_TXRDY_Pos)                     /**< (US_IMR) TXRDY Interrupt Mask Mask */
#define US_IMR_OVRE_Pos                       (5)                                            /**< (US_IMR) Overrun Error Interrupt Mask Position */
#define US_IMR_OVRE_Msk                       (0x1U << US_IMR_OVRE_Pos)                      /**< (US_IMR) Overrun Error Interrupt Mask Mask */
#define US_IMR_TXEMPTY_Pos                    (9)                                            /**< (US_IMR) TXEMPTY Interrupt Mask Position */
#define US_IMR_TXEMPTY_Msk                    (0x1U << US_IMR_TXEMPTY_Pos)                   /**< (US_IMR) TXEMPTY Interrupt Mask Mask */
#define US_IMR_RIIC_Pos                       (16)                                           /**< (US_IMR) Ring Indicator Input Change Mask Position */
#define US_IMR_RIIC_Msk                       (0x1U << US_IMR_RIIC_Pos)                      /**< (US_IMR) Ring Indicator Input Change Mask Mask */
#define US_IMR_DSRIC_Pos                      (17)                                           /**< (US_IMR) Data Set Ready Input Change Mask Position */
#define US_IMR_DSRIC_Msk                      (0x1U << US_IMR_DSRIC_Pos)                     /**< (US_IMR) Data Set Ready Input Change Mask Mask */
#define US_IMR_DCDIC_Pos                      (18)                                           /**< (US_IMR) Data Carrier Detect Input Change Interrupt Mask Position */
#define US_IMR_DCDIC_Msk                      (0x1U << US_IMR_DCDIC_Pos)                     /**< (US_IMR) Data Carrier Detect Input Change Interrupt Mask Mask */
/* USART mode */
#define US_IMR_RXBRK_Pos                      (2)                                            /**< (US_IMR) Receiver Break Interrupt Mask Position */
#define US_IMR_RXBRK_Msk                      (0x1U << US_IMR_RXBRK_Pos)                     /**< (US_IMR) Receiver Break Interrupt Mask Mask */
#define US_IMR_ITER_Pos                       (10)                                           /**< (US_IMR) Max Number of Repetitions Reached Interrupt Mask Position */
#define US_IMR_ITER_Msk                       (0x1U << US_IMR_ITER_Pos)                      /**< (US_IMR) Max Number of Repetitions Reached Interrupt Mask Mask */
#define US_IMR_NACK_Pos                       (13)                                           /**< (US_IMR) Non Acknowledge Interrupt Mask Position */
#define US_IMR_NACK_Msk                       (0x1U << US_IMR_NACK_Pos)                      /**< (US_IMR) Non Acknowledge Interrupt Mask Mask */
#define US_IMR_CTSIC_Pos                      (19)                                           /**< (US_IMR) Clear to Send Input Change Interrupt Mask Position */
#define US_IMR_CTSIC_Msk                      (0x1U << US_IMR_CTSIC_Pos)                     /**< (US_IMR) Clear to Send Input Change Interrupt Mask Mask */
#define US_IMR_MANE_Pos                       (24)                                           /**< (US_IMR) Manchester Error Interrupt Mask Position */
#define US_IMR_MANE_Msk                       (0x1U << US_IMR_MANE_Pos)                      /**< (US_IMR) Manchester Error Interrupt Mask Mask */
/* USART and LIN mode */
#define US_IMR_FRAME_Pos                      (6)                                            /**< (US_IMR) Framing Error Interrupt Mask Position */
#define US_IMR_FRAME_Msk                      (0x1U << US_IMR_FRAME_Pos)                     /**< (US_IMR) Framing Error Interrupt Mask Mask */
#define US_IMR_PARE_Pos                       (7)                                            /**< (US_IMR) Parity Error Interrupt Mask Position */
#define US_IMR_PARE_Msk                       (0x1U << US_IMR_PARE_Pos)                      /**< (US_IMR) Parity Error Interrupt Mask Mask */
#define US_IMR_TIMEOUT_Pos                    (8)                                            /**< (US_IMR) Timeout Interrupt Mask Position */
#define US_IMR_TIMEOUT_Msk                    (0x1U << US_IMR_TIMEOUT_Pos)                   /**< (US_IMR) Timeout Interrupt Mask Mask */
/* SPI mode */
#define US_IMR_NSSE_Pos                       (19)                                           /**< (US_IMR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_IMR_NSSE_Msk                       (0x1U << US_IMR_NSSE_Pos)                      /**< (US_IMR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
/* LIN mode */
#define US_IMR_LINBK_Pos                      (13)                                           /**< (US_IMR) LIN Break Sent or LIN Break Received Interrupt Mask Position */
#define US_IMR_LINBK_Msk                      (0x1U << US_IMR_LINBK_Pos)                     /**< (US_IMR) LIN Break Sent or LIN Break Received Interrupt Mask Mask */
#define US_IMR_LINID_Pos                      (14)                                           /**< (US_IMR) LIN Identifier Sent or LIN Identifier Received Interrupt Mask Position */
#define US_IMR_LINID_Msk                      (0x1U << US_IMR_LINID_Pos)                     /**< (US_IMR) LIN Identifier Sent or LIN Identifier Received Interrupt Mask Mask */
#define US_IMR_LINTC_Pos                      (15)                                           /**< (US_IMR) LIN Transfer Completed Interrupt Mask Position */
#define US_IMR_LINTC_Msk                      (0x1U << US_IMR_LINTC_Pos)                     /**< (US_IMR) LIN Transfer Completed Interrupt Mask Mask */
#define US_IMR_LINBE_Pos                      (25)                                           /**< (US_IMR) LIN Bus Error Interrupt Mask Position */
#define US_IMR_LINBE_Msk                      (0x1U << US_IMR_LINBE_Pos)                     /**< (US_IMR) LIN Bus Error Interrupt Mask Mask */
#define US_IMR_LINISFE_Pos                    (26)                                           /**< (US_IMR) LIN Inconsistent Synch Field Error Interrupt Mask Position */
#define US_IMR_LINISFE_Msk                    (0x1U << US_IMR_LINISFE_Pos)                   /**< (US_IMR) LIN Inconsistent Synch Field Error Interrupt Mask Mask */
#define US_IMR_LINIPE_Pos                     (27)                                           /**< (US_IMR) LIN Identifier Parity Interrupt Mask Position */
#define US_IMR_LINIPE_Msk                     (0x1U << US_IMR_LINIPE_Pos)                    /**< (US_IMR) LIN Identifier Parity Interrupt Mask Mask */
#define US_IMR_LINCE_Pos                      (28)                                           /**< (US_IMR) LIN Checksum Error Interrupt Mask Position */
#define US_IMR_LINCE_Msk                      (0x1U << US_IMR_LINCE_Pos)                     /**< (US_IMR) LIN Checksum Error Interrupt Mask Mask */
#define US_IMR_LINSNRE_Pos                    (29)                                           /**< (US_IMR) LIN Slave Not Responding Error Interrupt Mask Position */
#define US_IMR_LINSNRE_Msk                    (0x1U << US_IMR_LINSNRE_Pos)                   /**< (US_IMR) LIN Slave Not Responding Error Interrupt Mask Mask */
#define US_IMR_LINSTE_Pos                     (30)                                           /**< (US_IMR) LIN Synch Tolerance Error Interrupt Mask Position */
#define US_IMR_LINSTE_Msk                     (0x1U << US_IMR_LINSTE_Pos)                    /**< (US_IMR) LIN Synch Tolerance Error Interrupt Mask Mask */
#define US_IMR_LINHTE_Pos                     (31)                                           /**< (US_IMR) LIN Header Timeout Error Interrupt Mask Position */
#define US_IMR_LINHTE_Msk                     (0x1U << US_IMR_LINHTE_Pos)                    /**< (US_IMR) LIN Header Timeout Error Interrupt Mask Mask */
/* LON mode */
#define US_IMR_LSFE_Pos                       (6)                                            /**< (US_IMR) LON Short Frame Error Interrupt Mask Position */
#define US_IMR_LSFE_Msk                       (0x1U << US_IMR_LSFE_Pos)                      /**< (US_IMR) LON Short Frame Error Interrupt Mask Mask */
#define US_IMR_LCRCE_Pos                      (7)                                            /**< (US_IMR) LON CRC Error Interrupt Mask Position */
#define US_IMR_LCRCE_Msk                      (0x1U << US_IMR_LCRCE_Pos)                     /**< (US_IMR) LON CRC Error Interrupt Mask Mask */
#define US_IMR_LTXD_Pos                       (24)                                           /**< (US_IMR) LON Transmission Done Interrupt Mask Position */
#define US_IMR_LTXD_Msk                       (0x1U << US_IMR_LTXD_Pos)                      /**< (US_IMR) LON Transmission Done Interrupt Mask Mask */
#define US_IMR_LCOL_Pos                       (25)                                           /**< (US_IMR) LON Collision Interrupt Mask Position */
#define US_IMR_LCOL_Msk                       (0x1U << US_IMR_LCOL_Pos)                      /**< (US_IMR) LON Collision Interrupt Mask Mask */
#define US_IMR_LFET_Pos                       (26)                                           /**< (US_IMR) LON Frame Early Termination Interrupt Mask Position */
#define US_IMR_LFET_Msk                       (0x1U << US_IMR_LFET_Pos)                      /**< (US_IMR) LON Frame Early Termination Interrupt Mask Mask */
#define US_IMR_LRXD_Pos                       (27)                                           /**< (US_IMR) LON Reception Done Interrupt Mask Position */
#define US_IMR_LRXD_Msk                       (0x1U << US_IMR_LRXD_Pos)                      /**< (US_IMR) LON Reception Done Interrupt Mask Mask */
#define US_IMR_LBLOVFE_Pos                    (28)                                           /**< (US_IMR) LON Backlog Overflow Error Interrupt Mask Position */
#define US_IMR_LBLOVFE_Msk                    (0x1U << US_IMR_LBLOVFE_Pos)                   /**< (US_IMR) LON Backlog Overflow Error Interrupt Mask Mask */
/* LON and SPI mode */
#define US_IMR_UNRE_Pos                       (10)                                           /**< (US_IMR) SPI Underrun Error Interrupt Mask Position */
#define US_IMR_UNRE_Msk                       (0x1U << US_IMR_UNRE_Pos)                      /**< (US_IMR) SPI Underrun Error Interrupt Mask Mask */

/* -------- US_CSR : (USART Offset: 0x14) (R/ 32) Channel Status Register -------- */

typedef union
{
  struct
  {
    uint32_t RXRDY:1;                   /**< bit:      0  Receiver Ready (cleared by reading US_RHR)    */
    uint32_t TXRDY:1;                   /**< bit:      1  Transmitter Ready (cleared by writing US_THR) */
    uint32_t :3;                        /**< bit:   2..4  Reserved                                      */
    uint32_t OVRE:1;                    /**< bit:      5  Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) */
    uint32_t :3;                        /**< bit:   6..8  Reserved                                      */
    uint32_t TXEMPTY:1;                 /**< bit:      9  Transmitter Empty (cleared by writing US_THR) */
    uint32_t :6;                        /**< bit: 10..15  Reserved                                      */
    uint32_t RIIC:1;                    /**< bit:     16  Ring Indicator Input Change Flag (cleared on read) */
    uint32_t DSRIC:1;                   /**< bit:     17  Data Set Ready Input Change Flag (cleared on read) */
    uint32_t DCDIC:1;                   /**< bit:     18  Data Carrier Detect Input Change Flag (cleared on read) */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  struct
  { // USART mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t RXBRK:1;                   /**< bit:      2  Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) */
    uint32_t :7;                        /**< bit:   3..9  Reserved                                      */
    uint32_t ITER:1;                    /**< bit:     10  Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) */
    uint32_t :2;                        /**< bit: 11..12  Reserved                                      */
    uint32_t NACK:1;                    /**< bit:     13  Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) */
    uint32_t :5;                        /**< bit: 14..18  Reserved                                      */
    uint32_t CTSIC:1;                   /**< bit:     19  Clear to Send Input Change Flag (cleared on read) */
    uint32_t RI:1;                      /**< bit:     20  Image of RI Input                             */
    uint32_t DSR:1;                     /**< bit:     21  Image of DSR Input                            */
    uint32_t DCD:1;                     /**< bit:     22  Image of DCD Input                            */
    uint32_t CTS:1;                     /**< bit:     23  Image of CTS Input                            */
    uint32_t MANERR:1;                  /**< bit:     24  Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  struct
  { // USART and LIN mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t FRAME:1;                   /**< bit:      6  Framing Error (cleared by writing a one to bit US_CR.RSTSTA) */
    uint32_t PARE:1;                    /**< bit:      7  Parity Error (cleared by writing a one to bit US_CR.RSTSTA) */
    uint32_t TIMEOUT:1;                 /**< bit:      8  Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  struct
  { // SPI mode
    uint32_t :19;                       /**< bit:  0..18  Reserved                                      */
    uint32_t NSSE:1;                    /**< bit:     19  NSS Line (Driving CTS Pin) Rising or Falling Edge Event */
    uint32_t :3;                        /**< bit: 20..22  Reserved                                      */
    uint32_t NSS:1;                     /**< bit:     23  Image of NSS Line                             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  { // LIN mode
    uint32_t :13;                       /**< bit:  0..12  Reserved                                      */
    uint32_t LINBK:1;                   /**< bit:     13  LIN Break Sent or LIN Break Received          */
    uint32_t LINID:1;                   /**< bit:     14  LIN Identifier Sent or LIN Identifier Received */
    uint32_t LINTC:1;                   /**< bit:     15  LIN Transfer Completed                        */
    uint32_t :7;                        /**< bit: 16..22  Reserved                                      */
    uint32_t LINBLS:1;                  /**< bit:     23  LIN Bus Line Status                           */
    uint32_t :1;                        /**< bit:     24  Reserved                                      */
    uint32_t LINBE:1;                   /**< bit:     25  LIN Bus Error                                 */
    uint32_t LINISFE:1;                 /**< bit:     26  LIN Inconsistent Synch Field Error            */
    uint32_t LINIPE:1;                  /**< bit:     27  LIN Identifier Parity Error                   */
    uint32_t LINCE:1;                   /**< bit:     28  LIN Checksum Error                            */
    uint32_t LINSNRE:1;                 /**< bit:     29  LIN Slave Not Responding Error Interrupt Mask */
    uint32_t LINSTE:1;                  /**< bit:     30  LIN Synch Tolerance Error                     */
    uint32_t LINHTE:1;                  /**< bit:     31  LIN Header Timeout Error                      */
  };
  struct
  { // LON mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t LSFE:1;                    /**< bit:      6  LON Short Frame Error                         */
    uint32_t LCRCE:1;                   /**< bit:      7  LON CRC Error                                 */
    uint32_t :16;                       /**< bit:  8..23  Reserved                                      */
    uint32_t LTXD:1;                    /**< bit:     24  LON Transmission End Flag                     */
    uint32_t LCOL:1;                    /**< bit:     25  LON Collision Detected Flag                   */
    uint32_t LFET:1;                    /**< bit:     26  LON Frame Early Termination                   */
    uint32_t LRXD:1;                    /**< bit:     27  LON Reception End Flag                        */
    uint32_t LBLOVFE:1;                 /**< bit:     28  LON Backlog Overflow Error                    */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  struct
  { // LON and SPI mode
    uint32_t :10;                       /**< bit:   0..9  Reserved                                      */
    uint32_t UNRE:1;                    /**< bit:     10  SPI Underrun Error                            */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __US_CSR_bits_t;

