zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usart.h
#define US_CSR_RXRDY_Pos                      (0)                                            /**< (US_CSR) Receiver Ready (cleared by reading US_RHR) Position */
#define US_CSR_RXRDY_Msk                      (0x1U << US_CSR_RXRDY_Pos)                     /**< (US_CSR) Receiver Ready (cleared by reading US_RHR) Mask */
#define US_CSR_TXRDY_Pos                      (1)                                            /**< (US_CSR) Transmitter Ready (cleared by writing US_THR) Position */
#define US_CSR_TXRDY_Msk                      (0x1U << US_CSR_TXRDY_Pos)                     /**< (US_CSR) Transmitter Ready (cleared by writing US_THR) Mask */
#define US_CSR_OVRE_Pos                       (5)                                            /**< (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_OVRE_Msk                       (0x1U << US_CSR_OVRE_Pos)                      /**< (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_TXEMPTY_Pos                    (9)                                            /**< (US_CSR) Transmitter Empty (cleared by writing US_THR) Position */
#define US_CSR_TXEMPTY_Msk                    (0x1U << US_CSR_TXEMPTY_Pos)                   /**< (US_CSR) Transmitter Empty (cleared by writing US_THR) Mask */
#define US_CSR_RIIC_Pos                       (16)                                           /**< (US_CSR) Ring Indicator Input Change Flag (cleared on read) Position */
#define US_CSR_RIIC_Msk                       (0x1U << US_CSR_RIIC_Pos)                      /**< (US_CSR) Ring Indicator Input Change Flag (cleared on read) Mask */
#define US_CSR_DSRIC_Pos                      (17)                                           /**< (US_CSR) Data Set Ready Input Change Flag (cleared on read) Position */
#define US_CSR_DSRIC_Msk                      (0x1U << US_CSR_DSRIC_Pos)                     /**< (US_CSR) Data Set Ready Input Change Flag (cleared on read) Mask */
#define US_CSR_DCDIC_Pos                      (18)                                           /**< (US_CSR) Data Carrier Detect Input Change Flag (cleared on read) Position */
#define US_CSR_DCDIC_Msk                      (0x1U << US_CSR_DCDIC_Pos)                     /**< (US_CSR) Data Carrier Detect Input Change Flag (cleared on read) Mask */
/* USART mode */
#define US_CSR_RXBRK_Pos                      (2)                                            /**< (US_CSR) Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_RXBRK_Msk                      (0x1U << US_CSR_RXBRK_Pos)                     /**< (US_CSR) Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_ITER_Pos                       (10)                                           /**< (US_CSR) Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) Position */
#define US_CSR_ITER_Msk                       (0x1U << US_CSR_ITER_Pos)                      /**< (US_CSR) Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) Mask */
#define US_CSR_NACK_Pos                       (13)                                           /**< (US_CSR) Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) Position */
#define US_CSR_NACK_Msk                       (0x1U << US_CSR_NACK_Pos)                      /**< (US_CSR) Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) Mask */
#define US_CSR_CTSIC_Pos                      (19)                                           /**< (US_CSR) Clear to Send Input Change Flag (cleared on read) Position */
#define US_CSR_CTSIC_Msk                      (0x1U << US_CSR_CTSIC_Pos)                     /**< (US_CSR) Clear to Send Input Change Flag (cleared on read) Mask */
#define US_CSR_RI_Pos                         (20)                                           /**< (US_CSR) Image of RI Input Position */
#define US_CSR_RI_Msk                         (0x1U << US_CSR_RI_Pos)                        /**< (US_CSR) Image of RI Input Mask */
#define US_CSR_DSR_Pos                        (21)                                           /**< (US_CSR) Image of DSR Input Position */
#define US_CSR_DSR_Msk                        (0x1U << US_CSR_DSR_Pos)                       /**< (US_CSR) Image of DSR Input Mask */
#define US_CSR_DCD_Pos                        (22)                                           /**< (US_CSR) Image of DCD Input Position */
#define US_CSR_DCD_Msk                        (0x1U << US_CSR_DCD_Pos)                       /**< (US_CSR) Image of DCD Input Mask */
#define US_CSR_CTS_Pos                        (23)                                           /**< (US_CSR) Image of CTS Input Position */
#define US_CSR_CTS_Msk                        (0x1U << US_CSR_CTS_Pos)                       /**< (US_CSR) Image of CTS Input Mask */
#define US_CSR_MANERR_Pos                     (24)                                           /**< (US_CSR) Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) Position */
#define US_CSR_MANERR_Msk                     (0x1U << US_CSR_MANERR_Pos)                    /**< (US_CSR) Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) Mask */
/* USART and LIN mode */
#define US_CSR_FRAME_Pos                      (6)                                            /**< (US_CSR) Framing Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_FRAME_Msk                      (0x1U << US_CSR_FRAME_Pos)                     /**< (US_CSR) Framing Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_PARE_Pos                       (7)                                            /**< (US_CSR) Parity Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_PARE_Msk                       (0x1U << US_CSR_PARE_Pos)                      /**< (US_CSR) Parity Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_TIMEOUT_Pos                    (8)                                            /**< (US_CSR) Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) Position */
#define US_CSR_TIMEOUT_Msk                    (0x1U << US_CSR_TIMEOUT_Pos)                   /**< (US_CSR) Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) Mask */
/* SPI mode */
#define US_CSR_NSSE_Pos                       (19)                                           /**< (US_CSR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_CSR_NSSE_Msk                       (0x1U << US_CSR_NSSE_Pos)                      /**< (US_CSR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
#define US_CSR_NSS_Pos                        (23)                                           /**< (US_CSR) Image of NSS Line Position */
#define US_CSR_NSS_Msk                        (0x1U << US_CSR_NSS_Pos)                       /**< (US_CSR) Image of NSS Line Mask */
/* LIN mode */
#define US_CSR_LINBK_Pos                      (13)                                           /**< (US_CSR) LIN Break Sent or LIN Break Received Position */
#define US_CSR_LINBK_Msk                      (0x1U << US_CSR_LINBK_Pos)                     /**< (US_CSR) LIN Break Sent or LIN Break Received Mask */
#define US_CSR_LINID_Pos                      (14)                                           /**< (US_CSR) LIN Identifier Sent or LIN Identifier Received Position */
#define US_CSR_LINID_Msk                      (0x1U << US_CSR_LINID_Pos)                     /**< (US_CSR) LIN Identifier Sent or LIN Identifier Received Mask */
#define US_CSR_LINTC_Pos                      (15)                                           /**< (US_CSR) LIN Transfer Completed Position */
#define US_CSR_LINTC_Msk                      (0x1U << US_CSR_LINTC_Pos)                     /**< (US_CSR) LIN Transfer Completed Mask */
#define US_CSR_LINBLS_Pos                     (23)                                           /**< (US_CSR) LIN Bus Line Status Position */
#define US_CSR_LINBLS_Msk                     (0x1U << US_CSR_LINBLS_Pos)                    /**< (US_CSR) LIN Bus Line Status Mask */
#define US_CSR_LINBE_Pos                      (25)                                           /**< (US_CSR) LIN Bus Error Position */
#define US_CSR_LINBE_Msk                      (0x1U << US_CSR_LINBE_Pos)                     /**< (US_CSR) LIN Bus Error Mask */
#define US_CSR_LINISFE_Pos                    (26)                                           /**< (US_CSR) LIN Inconsistent Synch Field Error Position */
#define US_CSR_LINISFE_Msk                    (0x1U << US_CSR_LINISFE_Pos)                   /**< (US_CSR) LIN Inconsistent Synch Field Error Mask */
#define US_CSR_LINIPE_Pos                     (27)                                           /**< (US_CSR) LIN Identifier Parity Error Position */
#define US_CSR_LINIPE_Msk                     (0x1U << US_CSR_LINIPE_Pos)                    /**< (US_CSR) LIN Identifier Parity Error Mask */
#define US_CSR_LINCE_Pos                      (28)                                           /**< (US_CSR) LIN Checksum Error Position */
#define US_CSR_LINCE_Msk                      (0x1U << US_CSR_LINCE_Pos)                     /**< (US_CSR) LIN Checksum Error Mask */
#define US_CSR_LINSNRE_Pos                    (29)                                           /**< (US_CSR) LIN Slave Not Responding Error Interrupt Mask Position */
#define US_CSR_LINSNRE_Msk                    (0x1U << US_CSR_LINSNRE_Pos)                   /**< (US_CSR) LIN Slave Not Responding Error Interrupt Mask Mask */
#define US_CSR_LINSTE_Pos                     (30)                                           /**< (US_CSR) LIN Synch Tolerance Error Position */
#define US_CSR_LINSTE_Msk                     (0x1U << US_CSR_LINSTE_Pos)                    /**< (US_CSR) LIN Synch Tolerance Error Mask */
#define US_CSR_LINHTE_Pos                     (31)                                           /**< (US_CSR) LIN Header Timeout Error Position */
#define US_CSR_LINHTE_Msk                     (0x1U << US_CSR_LINHTE_Pos)                    /**< (US_CSR) LIN Header Timeout Error Mask */
/* LON mode */
#define US_CSR_LSFE_Pos                       (6)                                            /**< (US_CSR) LON Short Frame Error Position */
#define US_CSR_LSFE_Msk                       (0x1U << US_CSR_LSFE_Pos)                      /**< (US_CSR) LON Short Frame Error Mask */
#define US_CSR_LCRCE_Pos                      (7)                                            /**< (US_CSR) LON CRC Error Position */
#define US_CSR_LCRCE_Msk                      (0x1U << US_CSR_LCRCE_Pos)                     /**< (US_CSR) LON CRC Error Mask */
#define US_CSR_LTXD_Pos                       (24)                                           /**< (US_CSR) LON Transmission End Flag Position */
#define US_CSR_LTXD_Msk                       (0x1U << US_CSR_LTXD_Pos)                      /**< (US_CSR) LON Transmission End Flag Mask */
#define US_CSR_LCOL_Pos                       (25)                                           /**< (US_CSR) LON Collision Detected Flag Position */
#define US_CSR_LCOL_Msk                       (0x1U << US_CSR_LCOL_Pos)                      /**< (US_CSR) LON Collision Detected Flag Mask */
#define US_CSR_LFET_Pos                       (26)                                           /**< (US_CSR) LON Frame Early Termination Position */
#define US_CSR_LFET_Msk                       (0x1U << US_CSR_LFET_Pos)                      /**< (US_CSR) LON Frame Early Termination Mask */
#define US_CSR_LRXD_Pos                       (27)                                           /**< (US_CSR) LON Reception End Flag Position */
#define US_CSR_LRXD_Msk                       (0x1U << US_CSR_LRXD_Pos)                      /**< (US_CSR) LON Reception End Flag Mask */
#define US_CSR_LBLOVFE_Pos                    (28)                                           /**< (US_CSR) LON Backlog Overflow Error Position */
#define US_CSR_LBLOVFE_Msk                    (0x1U << US_CSR_LBLOVFE_Pos)                   /**< (US_CSR) LON Backlog Overflow Error Mask */
/* LON and SPI mode */
#define US_CSR_UNRE_Pos                       (10)                                           /**< (US_CSR) SPI Underrun Error Position */
#define US_CSR_UNRE_Msk                       (0x1U << US_CSR_UNRE_Pos)                      /**< (US_CSR) SPI Underrun Error Mask */

/* -------- US_RHR : (USART Offset: 0x18) (R/ 32) Receive Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t RXCHR:9;                   /**< bit:   0..8  Received Character                            */
    uint32_t :6;                        /**< bit:  9..14  Reserved                                      */
    uint32_t RXSYNH:1;                  /**< bit:     15  Received Sync                                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __US_RHR_bits_t;

#define US_RHR_RXCHR_Pos                      (0)                                            /**< (US_RHR) Received Character Position */
#define US_RHR_RXCHR_Msk                      (0x1FFU << US_RHR_RXCHR_Pos)                   /**< (US_RHR) Received Character Mask */
#define US_RHR_RXCHR(value)                   (US_RHR_RXCHR_Msk & ((value) << US_RHR_RXCHR_Pos))
#define US_RHR_RXSYNH_Pos                     (15)                                           /**< (US_RHR) Received Sync Position */
#define US_RHR_RXSYNH_Msk                     (0x1U << US_RHR_RXSYNH_Pos)                    /**< (US_RHR) Received Sync Mask */
#define US_RHR_Msk                            (0x000081FFUL)                                 /**< (US_RHR) Register Mask  */

/* -------- US_THR : (USART Offset: 0x1c) (/W 32) Transmit Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t TXCHR:9;                   /**< bit:   0..8  Character to be Transmitted                   */
    uint32_t :6;                        /**< bit:  9..14  Reserved                                      */
    uint32_t TXSYNH:1;                  /**< bit:     15  Sync Field to be Transmitted                  */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __US_THR_bits_t;

#define US_THR_TXCHR_Pos                      (0)                                            /**< (US_THR) Character to be Transmitted Position */
#define US_THR_TXCHR_Msk                      (0x1FFU << US_THR_TXCHR_Pos)                   /**< (US_THR) Character to be Transmitted Mask */
#define US_THR_TXCHR(value)                   (US_THR_TXCHR_Msk & ((value) << US_THR_TXCHR_Pos))
#define US_THR_TXSYNH_Pos                     (15)                                           /**< (US_THR) Sync Field to be Transmitted Position */
#define US_THR_TXSYNH_Msk                     (0x1U << US_THR_TXSYNH_Pos)                    /**< (US_THR) Sync Field to be Transmitted Mask */
#define US_THR_Msk                            (0x000081FFUL)                                 /**< (US_THR) Register Mask  */

