zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usart.h
/* -------- US_BRGR : (USART Offset: 0x20) (R/W 32) Baud Rate Generator Register -------- */

typedef union
{
  struct
  {
    uint32_t CD:16;                     /**< bit:  0..15  Clock Divider                                 */
    uint32_t FP:3;                      /**< bit: 16..18  Fractional Part                               */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  uint32_t w;
} __US_BRGR_bits_t;

#define US_BRGR_CD_Pos                        (0)                                            /**< (US_BRGR) Clock Divider Position */
#define US_BRGR_CD_Msk                        (0xFFFFU << US_BRGR_CD_Pos)                    /**< (US_BRGR) Clock Divider Mask */
#define US_BRGR_CD(value)                     (US_BRGR_CD_Msk & ((value) << US_BRGR_CD_Pos))
#define US_BRGR_FP_Pos                        (16)                                           /**< (US_BRGR) Fractional Part Position */
#define US_BRGR_FP_Msk                        (0x7U << US_BRGR_FP_Pos)                       /**< (US_BRGR) Fractional Part Mask */
#define US_BRGR_FP(value)                     (US_BRGR_FP_Msk & ((value) << US_BRGR_FP_Pos))
#define US_BRGR_Msk                           (0x0007FFFFUL)                                 /**< (US_BRGR) Register Mask  */

/* -------- US_RTOR : (USART Offset: 0x24) (R/W 32) Receiver Timeout Register -------- */

typedef union
{
  struct
  {
    uint32_t TO:17;                     /**< bit:  0..16  Timeout Value                                 */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __US_RTOR_bits_t;

#define US_RTOR_TO_Pos                        (0)                                            /**< (US_RTOR) Timeout Value Position */
#define US_RTOR_TO_Msk                        (0x1FFFFU << US_RTOR_TO_Pos)                   /**< (US_RTOR) Timeout Value Mask */
#define US_RTOR_TO(value)                     (US_RTOR_TO_Msk & ((value) << US_RTOR_TO_Pos))
#define US_RTOR_Msk                           (0x0001FFFFUL)                                 /**< (US_RTOR) Register Mask  */

/* -------- US_TTGR : (USART Offset: 0x28) (R/W 32) Transmitter Timeguard Register -------- */

typedef union
{
  struct
  { // USART mode
    uint32_t TG:8;                      /**< bit:   0..7  Timeguard Value                               */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  struct
  { // LON mode
    uint32_t PCYCLE:24;                 /**< bit:  0..23  LON PCYCLE Length                             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __US_TTGR_bits_t;

/* USART mode */
#define US_TTGR_TG_Pos                        (0)                                            /**< (US_TTGR) Timeguard Value Position */
#define US_TTGR_TG_Msk                        (0xFFU << US_TTGR_TG_Pos)                      /**< (US_TTGR) Timeguard Value Mask */
#define US_TTGR_TG(value)                     (US_TTGR_TG_Msk & ((value) << US_TTGR_TG_Pos))
/* LON mode */
#define US_TTGR_PCYCLE_Pos                    (0)                                            /**< (US_TTGR) LON PCYCLE Length Position */
#define US_TTGR_PCYCLE_Msk                    (0xFFFFFFU << US_TTGR_PCYCLE_Pos)              /**< (US_TTGR) LON PCYCLE Length Mask */
#define US_TTGR_PCYCLE(value)                 (US_TTGR_PCYCLE_Msk & ((value) << US_TTGR_PCYCLE_Pos))

/* -------- US_FIDI : (USART Offset: 0x40) (R/W 32) FI DI Ratio Register -------- */

typedef union
{
  struct
  { // USART mode
    uint32_t FI_DI_RATIO:16;            /**< bit:  0..15  FI Over DI Ratio Value                        */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  struct
  { // LON mode
    uint32_t BETA2:24;                  /**< bit:  0..23  LON BETA2 Length                              */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __US_FIDI_bits_t;

/* USART mode */
#define US_FIDI_FI_DI_RATIO_Pos               (0)                                            /**< (US_FIDI) FI Over DI Ratio Value Position */
#define US_FIDI_FI_DI_RATIO_Msk               (0xFFFFU << US_FIDI_FI_DI_RATIO_Pos)           /**< (US_FIDI) FI Over DI Ratio Value Mask */
#define US_FIDI_FI_DI_RATIO(value)            (US_FIDI_FI_DI_RATIO_Msk & ((value) << US_FIDI_FI_DI_RATIO_Pos))
/* LON mode */
#define US_FIDI_BETA2_Pos                     (0)                                            /**< (US_FIDI) LON BETA2 Length Position */
#define US_FIDI_BETA2_Msk                     (0xFFFFFFU << US_FIDI_BETA2_Pos)               /**< (US_FIDI) LON BETA2 Length Mask */
#define US_FIDI_BETA2(value)                  (US_FIDI_BETA2_Msk & ((value) << US_FIDI_BETA2_Pos))

/* -------- US_NER : (USART Offset: 0x44) (R/ 32) Number of Errors Register -------- */

typedef union
{
  struct
  {
    uint32_t NB_ERRORS:8;               /**< bit:   0..7  Number of Errors                              */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __US_NER_bits_t;

#define US_NER_NB_ERRORS_Pos                  (0)                                            /**< (US_NER) Number of Errors Position */
#define US_NER_NB_ERRORS_Msk                  (0xFFU << US_NER_NB_ERRORS_Pos)                /**< (US_NER) Number of Errors Mask */
#define US_NER_NB_ERRORS(value)               (US_NER_NB_ERRORS_Msk & ((value) << US_NER_NB_ERRORS_Pos))
#define US_NER_Msk                            (0x000000FFUL)                                 /**< (US_NER) Register Mask  */

/* -------- US_IF : (USART Offset: 0x4c) (R/W 32) IrDA Filter Register -------- */

typedef union
{
  struct
  {
    uint32_t IRDA_FILTER:8;             /**< bit:   0..7  IrDA Filter                                   */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __US_IF_bits_t;

