zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usart.h
#define US_IF_IRDA_FILTER_Pos                 (0)                                            /**< (US_IF) IrDA Filter Position */
#define US_IF_IRDA_FILTER_Msk                 (0xFFU << US_IF_IRDA_FILTER_Pos)               /**< (US_IF) IrDA Filter Mask */
#define US_IF_IRDA_FILTER(value)              (US_IF_IRDA_FILTER_Msk & ((value) << US_IF_IRDA_FILTER_Pos))
#define US_IF_Msk                             (0x000000FFUL)                                 /**< (US_IF) Register Mask  */

/* -------- US_MAN : (USART Offset: 0x50) (R/W 32) Manchester Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t TX_PL:4;                   /**< bit:   0..3  Transmitter Preamble Length                   */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t TX_PP:2;                   /**< bit:   8..9  Transmitter Preamble Pattern                  */
    uint32_t :2;                        /**< bit: 10..11  Reserved                                      */
    uint32_t TX_MPOL:1;                 /**< bit:     12  Transmitter Manchester Polarity               */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t RX_PL:4;                   /**< bit: 16..19  Receiver Preamble Length                      */
    uint32_t :4;                        /**< bit: 20..23  Reserved                                      */
    uint32_t RX_PP:2;                   /**< bit: 24..25  Receiver Preamble Pattern detected            */
    uint32_t :2;                        /**< bit: 26..27  Reserved                                      */
    uint32_t RX_MPOL:1;                 /**< bit:     28  Receiver Manchester Polarity                  */
    uint32_t ONE:1;                     /**< bit:     29  Must Be Set to 1                              */
    uint32_t DRIFT:1;                   /**< bit:     30  Drift Compensation                            */
    uint32_t RXIDLEV:1;                 /**< bit:     31  Receiver Idle Value                           */
  };
  uint32_t w;
} __US_MAN_bits_t;

#define US_MAN_TX_PL_Pos                      (0)                                            /**< (US_MAN) Transmitter Preamble Length Position */
#define US_MAN_TX_PL_Msk                      (0xFU << US_MAN_TX_PL_Pos)                     /**< (US_MAN) Transmitter Preamble Length Mask */
#define US_MAN_TX_PL(value)                   (US_MAN_TX_PL_Msk & ((value) << US_MAN_TX_PL_Pos))
#define US_MAN_TX_PP_Pos                      (8)                                            /**< (US_MAN) Transmitter Preamble Pattern Position */
#define US_MAN_TX_PP_Msk                      (0x3U << US_MAN_TX_PP_Pos)                     /**< (US_MAN) Transmitter Preamble Pattern Mask */
#define US_MAN_TX_PP(value)                   (US_MAN_TX_PP_Msk & ((value) << US_MAN_TX_PP_Pos))
#define   US_MAN_TX_PP_ALL_ONE_Val            (0x0U)                                         /**< (US_MAN) The preamble is composed of '1's  */
#define   US_MAN_TX_PP_ALL_ZERO_Val           (0x1U)                                         /**< (US_MAN) The preamble is composed of '0's  */
#define   US_MAN_TX_PP_ZERO_ONE_Val           (0x2U)                                         /**< (US_MAN) The preamble is composed of '01's  */
#define   US_MAN_TX_PP_ONE_ZERO_Val           (0x3U)                                         /**< (US_MAN) The preamble is composed of '10's  */
#define US_MAN_TX_PP_ALL_ONE                  (US_MAN_TX_PP_ALL_ONE_Val << US_MAN_TX_PP_Pos)  /**< (US_MAN) The preamble is composed of '1's Position  */
#define US_MAN_TX_PP_ALL_ZERO                 (US_MAN_TX_PP_ALL_ZERO_Val << US_MAN_TX_PP_Pos)  /**< (US_MAN) The preamble is composed of '0's Position  */
#define US_MAN_TX_PP_ZERO_ONE                 (US_MAN_TX_PP_ZERO_ONE_Val << US_MAN_TX_PP_Pos)  /**< (US_MAN) The preamble is composed of '01's Position  */
#define US_MAN_TX_PP_ONE_ZERO                 (US_MAN_TX_PP_ONE_ZERO_Val << US_MAN_TX_PP_Pos)  /**< (US_MAN) The preamble is composed of '10's Position  */
#define US_MAN_TX_MPOL_Pos                    (12)                                           /**< (US_MAN) Transmitter Manchester Polarity Position */
#define US_MAN_TX_MPOL_Msk                    (0x1U << US_MAN_TX_MPOL_Pos)                   /**< (US_MAN) Transmitter Manchester Polarity Mask */
#define US_MAN_RX_PL_Pos                      (16)                                           /**< (US_MAN) Receiver Preamble Length Position */
#define US_MAN_RX_PL_Msk                      (0xFU << US_MAN_RX_PL_Pos)                     /**< (US_MAN) Receiver Preamble Length Mask */
#define US_MAN_RX_PL(value)                   (US_MAN_RX_PL_Msk & ((value) << US_MAN_RX_PL_Pos))
#define US_MAN_RX_PP_Pos                      (24)                                           /**< (US_MAN) Receiver Preamble Pattern detected Position */
#define US_MAN_RX_PP_Msk                      (0x3U << US_MAN_RX_PP_Pos)                     /**< (US_MAN) Receiver Preamble Pattern detected Mask */
#define US_MAN_RX_PP(value)                   (US_MAN_RX_PP_Msk & ((value) << US_MAN_RX_PP_Pos))
#define   US_MAN_RX_PP_ALL_ONE_Val            (0x0U)                                         /**< (US_MAN) The preamble is composed of '1's  */
#define   US_MAN_RX_PP_ALL_ZERO_Val           (0x1U)                                         /**< (US_MAN) The preamble is composed of '0's  */
#define   US_MAN_RX_PP_ZERO_ONE_Val           (0x2U)                                         /**< (US_MAN) The preamble is composed of '01's  */
#define   US_MAN_RX_PP_ONE_ZERO_Val           (0x3U)                                         /**< (US_MAN) The preamble is composed of '10's  */
#define US_MAN_RX_PP_ALL_ONE                  (US_MAN_RX_PP_ALL_ONE_Val << US_MAN_RX_PP_Pos)  /**< (US_MAN) The preamble is composed of '1's Position  */
#define US_MAN_RX_PP_ALL_ZERO                 (US_MAN_RX_PP_ALL_ZERO_Val << US_MAN_RX_PP_Pos)  /**< (US_MAN) The preamble is composed of '0's Position  */
#define US_MAN_RX_PP_ZERO_ONE                 (US_MAN_RX_PP_ZERO_ONE_Val << US_MAN_RX_PP_Pos)  /**< (US_MAN) The preamble is composed of '01's Position  */
#define US_MAN_RX_PP_ONE_ZERO                 (US_MAN_RX_PP_ONE_ZERO_Val << US_MAN_RX_PP_Pos)  /**< (US_MAN) The preamble is composed of '10's Position  */
#define US_MAN_RX_MPOL_Pos                    (28)                                           /**< (US_MAN) Receiver Manchester Polarity Position */
#define US_MAN_RX_MPOL_Msk                    (0x1U << US_MAN_RX_MPOL_Pos)                   /**< (US_MAN) Receiver Manchester Polarity Mask */
#define US_MAN_ONE_Pos                        (29)                                           /**< (US_MAN) Must Be Set to 1 Position */
#define US_MAN_ONE_Msk                        (0x1U << US_MAN_ONE_Pos)                       /**< (US_MAN) Must Be Set to 1 Mask */
#define US_MAN_DRIFT_Pos                      (30)                                           /**< (US_MAN) Drift Compensation Position */
#define US_MAN_DRIFT_Msk                      (0x1U << US_MAN_DRIFT_Pos)                     /**< (US_MAN) Drift Compensation Mask */
#define US_MAN_RXIDLEV_Pos                    (31)                                           /**< (US_MAN) Receiver Idle Value Position */
#define US_MAN_RXIDLEV_Msk                    (0x1U << US_MAN_RXIDLEV_Pos)                   /**< (US_MAN) Receiver Idle Value Mask */
#define US_MAN_Msk                            (0xF30F130FUL)                                 /**< (US_MAN) Register Mask  */

/* -------- US_LINMR : (USART Offset: 0x54) (R/W 32) LIN Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t NACT:2;                    /**< bit:   0..1  LIN Node Action                               */
    uint32_t PARDIS:1;                  /**< bit:      2  Parity Disable                                */
    uint32_t CHKDIS:1;                  /**< bit:      3  Checksum Disable                              */
    uint32_t CHKTYP:1;                  /**< bit:      4  Checksum Type                                 */
    uint32_t DLM:1;                     /**< bit:      5  Data Length Mode                              */
    uint32_t FSDIS:1;                   /**< bit:      6  Frame Slot Mode Disable                       */
    uint32_t WKUPTYP:1;                 /**< bit:      7  Wakeup Signal Type                            */
    uint32_t DLC:8;                     /**< bit:  8..15  Data Length Control                           */
    uint32_t PDCM:1;                    /**< bit:     16  DMAC Mode                                     */
    uint32_t SYNCDIS:1;                 /**< bit:     17  Synchronization Disable                       */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  uint32_t w;
} __US_LINMR_bits_t;

#define US_LINMR_NACT_Pos                     (0)                                            /**< (US_LINMR) LIN Node Action Position */
#define US_LINMR_NACT_Msk                     (0x3U << US_LINMR_NACT_Pos)                    /**< (US_LINMR) LIN Node Action Mask */
#define US_LINMR_NACT(value)                  (US_LINMR_NACT_Msk & ((value) << US_LINMR_NACT_Pos))
#define   US_LINMR_NACT_PUBLISH_Val           (0x0U)                                         /**< (US_LINMR) The USART transmits the response.  */
#define   US_LINMR_NACT_SUBSCRIBE_Val         (0x1U)                                         /**< (US_LINMR) The USART receives the response.  */
#define   US_LINMR_NACT_IGNORE_Val            (0x2U)                                         /**< (US_LINMR) The USART does not transmit and does not receive the response.  */
#define US_LINMR_NACT_PUBLISH                 (US_LINMR_NACT_PUBLISH_Val << US_LINMR_NACT_Pos)  /**< (US_LINMR) The USART transmits the response. Position  */
#define US_LINMR_NACT_SUBSCRIBE               (US_LINMR_NACT_SUBSCRIBE_Val << US_LINMR_NACT_Pos)  /**< (US_LINMR) The USART receives the response. Position  */
#define US_LINMR_NACT_IGNORE                  (US_LINMR_NACT_IGNORE_Val << US_LINMR_NACT_Pos)  /**< (US_LINMR) The USART does not transmit and does not receive the response. Position  */
#define US_LINMR_PARDIS_Pos                   (2)                                            /**< (US_LINMR) Parity Disable Position */
#define US_LINMR_PARDIS_Msk                   (0x1U << US_LINMR_PARDIS_Pos)                  /**< (US_LINMR) Parity Disable Mask */
#define US_LINMR_CHKDIS_Pos                   (3)                                            /**< (US_LINMR) Checksum Disable Position */
#define US_LINMR_CHKDIS_Msk                   (0x1U << US_LINMR_CHKDIS_Pos)                  /**< (US_LINMR) Checksum Disable Mask */
#define US_LINMR_CHKTYP_Pos                   (4)                                            /**< (US_LINMR) Checksum Type Position */
#define US_LINMR_CHKTYP_Msk                   (0x1U << US_LINMR_CHKTYP_Pos)                  /**< (US_LINMR) Checksum Type Mask */
#define US_LINMR_DLM_Pos                      (5)                                            /**< (US_LINMR) Data Length Mode Position */
#define US_LINMR_DLM_Msk                      (0x1U << US_LINMR_DLM_Pos)                     /**< (US_LINMR) Data Length Mode Mask */
#define US_LINMR_FSDIS_Pos                    (6)                                            /**< (US_LINMR) Frame Slot Mode Disable Position */
#define US_LINMR_FSDIS_Msk                    (0x1U << US_LINMR_FSDIS_Pos)                   /**< (US_LINMR) Frame Slot Mode Disable Mask */
#define US_LINMR_WKUPTYP_Pos                  (7)                                            /**< (US_LINMR) Wakeup Signal Type Position */
#define US_LINMR_WKUPTYP_Msk                  (0x1U << US_LINMR_WKUPTYP_Pos)                 /**< (US_LINMR) Wakeup Signal Type Mask */
#define US_LINMR_DLC_Pos                      (8)                                            /**< (US_LINMR) Data Length Control Position */
#define US_LINMR_DLC_Msk                      (0xFFU << US_LINMR_DLC_Pos)                    /**< (US_LINMR) Data Length Control Mask */
#define US_LINMR_DLC(value)                   (US_LINMR_DLC_Msk & ((value) << US_LINMR_DLC_Pos))
#define US_LINMR_PDCM_Pos                     (16)                                           /**< (US_LINMR) DMAC Mode Position */
#define US_LINMR_PDCM_Msk                     (0x1U << US_LINMR_PDCM_Pos)                    /**< (US_LINMR) DMAC Mode Mask */
#define US_LINMR_SYNCDIS_Pos                  (17)                                           /**< (US_LINMR) Synchronization Disable Position */
#define US_LINMR_SYNCDIS_Msk                  (0x1U << US_LINMR_SYNCDIS_Pos)                 /**< (US_LINMR) Synchronization Disable Mask */
#define US_LINMR_Msk                          (0x0003FFFFUL)                                 /**< (US_LINMR) Register Mask  */

/* -------- US_LINIR : (USART Offset: 0x58) (R/W 32) LIN Identifier Register -------- */

typedef union
{
  struct
  {
    uint32_t IDCHR:8;                   /**< bit:   0..7  Identifier Character                          */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __US_LINIR_bits_t;

#define US_LINIR_IDCHR_Pos                    (0)                                            /**< (US_LINIR) Identifier Character Position */
#define US_LINIR_IDCHR_Msk                    (0xFFU << US_LINIR_IDCHR_Pos)                  /**< (US_LINIR) Identifier Character Mask */
#define US_LINIR_IDCHR(value)                 (US_LINIR_IDCHR_Msk & ((value) << US_LINIR_IDCHR_Pos))
#define US_LINIR_Msk                          (0x000000FFUL)                                 /**< (US_LINIR) Register Mask  */

