zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usart.h
/* -------- US_LINBRR : (USART Offset: 0x5c) (R/ 32) LIN Baud Rate Register -------- */

typedef union
{
  struct
  {
    uint32_t LINCD:16;                  /**< bit:  0..15  Clock Divider after Synchronization           */
    uint32_t LINFP:3;                   /**< bit: 16..18  Fractional Part after Synchronization         */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  uint32_t w;
} __US_LINBRR_bits_t;

#define US_LINBRR_LINCD_Pos                   (0)                                            /**< (US_LINBRR) Clock Divider after Synchronization Position */
#define US_LINBRR_LINCD_Msk                   (0xFFFFU << US_LINBRR_LINCD_Pos)               /**< (US_LINBRR) Clock Divider after Synchronization Mask */
#define US_LINBRR_LINCD(value)                (US_LINBRR_LINCD_Msk & ((value) << US_LINBRR_LINCD_Pos))
#define US_LINBRR_LINFP_Pos                   (16)                                           /**< (US_LINBRR) Fractional Part after Synchronization Position */
#define US_LINBRR_LINFP_Msk                   (0x7U << US_LINBRR_LINFP_Pos)                  /**< (US_LINBRR) Fractional Part after Synchronization Mask */
#define US_LINBRR_LINFP(value)                (US_LINBRR_LINFP_Msk & ((value) << US_LINBRR_LINFP_Pos))
#define US_LINBRR_Msk                         (0x0007FFFFUL)                                 /**< (US_LINBRR) Register Mask  */

/* -------- US_LONMR : (USART Offset: 0x60) (R/W 32) LON Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t COMMT:1;                   /**< bit:      0  LON comm_type Parameter Value                 */
    uint32_t COLDET:1;                  /**< bit:      1  LON Collision Detection Feature               */
    uint32_t TCOL:1;                    /**< bit:      2  Terminate Frame upon Collision Notification   */
    uint32_t CDTAIL:1;                  /**< bit:      3  LON Collision Detection on Frame Tail         */
    uint32_t DMAM:1;                    /**< bit:      4  LON DMA Mode                                  */
    uint32_t LCDS:1;                    /**< bit:      5  LON Collision Detection Source                */
    uint32_t :10;                       /**< bit:  6..15  Reserved                                      */
    uint32_t EOFS:8;                    /**< bit: 16..23  End of Frame Condition Size                   */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __US_LONMR_bits_t;

#define US_LONMR_COMMT_Pos                    (0)                                            /**< (US_LONMR) LON comm_type Parameter Value Position */
#define US_LONMR_COMMT_Msk                    (0x1U << US_LONMR_COMMT_Pos)                   /**< (US_LONMR) LON comm_type Parameter Value Mask */
#define US_LONMR_COLDET_Pos                   (1)                                            /**< (US_LONMR) LON Collision Detection Feature Position */
#define US_LONMR_COLDET_Msk                   (0x1U << US_LONMR_COLDET_Pos)                  /**< (US_LONMR) LON Collision Detection Feature Mask */
#define US_LONMR_TCOL_Pos                     (2)                                            /**< (US_LONMR) Terminate Frame upon Collision Notification Position */
#define US_LONMR_TCOL_Msk                     (0x1U << US_LONMR_TCOL_Pos)                    /**< (US_LONMR) Terminate Frame upon Collision Notification Mask */
#define US_LONMR_CDTAIL_Pos                   (3)                                            /**< (US_LONMR) LON Collision Detection on Frame Tail Position */
#define US_LONMR_CDTAIL_Msk                   (0x1U << US_LONMR_CDTAIL_Pos)                  /**< (US_LONMR) LON Collision Detection on Frame Tail Mask */
#define US_LONMR_DMAM_Pos                     (4)                                            /**< (US_LONMR) LON DMA Mode Position */
#define US_LONMR_DMAM_Msk                     (0x1U << US_LONMR_DMAM_Pos)                    /**< (US_LONMR) LON DMA Mode Mask */
#define US_LONMR_LCDS_Pos                     (5)                                            /**< (US_LONMR) LON Collision Detection Source Position */
#define US_LONMR_LCDS_Msk                     (0x1U << US_LONMR_LCDS_Pos)                    /**< (US_LONMR) LON Collision Detection Source Mask */
#define US_LONMR_EOFS_Pos                     (16)                                           /**< (US_LONMR) End of Frame Condition Size Position */
#define US_LONMR_EOFS_Msk                     (0xFFU << US_LONMR_EOFS_Pos)                   /**< (US_LONMR) End of Frame Condition Size Mask */
#define US_LONMR_EOFS(value)                  (US_LONMR_EOFS_Msk & ((value) << US_LONMR_EOFS_Pos))
#define US_LONMR_Msk                          (0x00FF003FUL)                                 /**< (US_LONMR) Register Mask  */

/* -------- US_LONPR : (USART Offset: 0x64) (R/W 32) LON Preamble Register -------- */

typedef union
{
  struct
  {
    uint32_t LONPL:14;                  /**< bit:  0..13  LON Preamble Length                           */
    uint32_t :18;                       /**< bit: 14..31  Reserved                                      */
  };
  uint32_t w;
} __US_LONPR_bits_t;

#define US_LONPR_LONPL_Pos                    (0)                                            /**< (US_LONPR) LON Preamble Length Position */
#define US_LONPR_LONPL_Msk                    (0x3FFFU << US_LONPR_LONPL_Pos)                /**< (US_LONPR) LON Preamble Length Mask */
#define US_LONPR_LONPL(value)                 (US_LONPR_LONPL_Msk & ((value) << US_LONPR_LONPL_Pos))
#define US_LONPR_Msk                          (0x00003FFFUL)                                 /**< (US_LONPR) Register Mask  */

/* -------- US_LONDL : (USART Offset: 0x68) (R/W 32) LON Data Length Register -------- */

typedef union
{
  struct
  {
    uint32_t LONDL:8;                   /**< bit:   0..7  LON Data Length                               */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __US_LONDL_bits_t;

#define US_LONDL_LONDL_Pos                    (0)                                            /**< (US_LONDL) LON Data Length Position */
#define US_LONDL_LONDL_Msk                    (0xFFU << US_LONDL_LONDL_Pos)                  /**< (US_LONDL) LON Data Length Mask */
#define US_LONDL_LONDL(value)                 (US_LONDL_LONDL_Msk & ((value) << US_LONDL_LONDL_Pos))
#define US_LONDL_Msk                          (0x000000FFUL)                                 /**< (US_LONDL) Register Mask  */

