zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usart.h
/* -------- US_LONL2HDR : (USART Offset: 0x6c) (R/W 32) LON L2HDR Register -------- */

typedef union
{
  struct
  {
    uint32_t BLI:6;                     /**< bit:   0..5  LON Backlog Increment                         */
    uint32_t ALTP:1;                    /**< bit:      6  LON Alternate Path Bit                        */
    uint32_t PB:1;                      /**< bit:      7  LON Priority Bit                              */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __US_LONL2HDR_bits_t;

#define US_LONL2HDR_BLI_Pos                   (0)                                            /**< (US_LONL2HDR) LON Backlog Increment Position */
#define US_LONL2HDR_BLI_Msk                   (0x3FU << US_LONL2HDR_BLI_Pos)                 /**< (US_LONL2HDR) LON Backlog Increment Mask */
#define US_LONL2HDR_BLI(value)                (US_LONL2HDR_BLI_Msk & ((value) << US_LONL2HDR_BLI_Pos))
#define US_LONL2HDR_ALTP_Pos                  (6)                                            /**< (US_LONL2HDR) LON Alternate Path Bit Position */
#define US_LONL2HDR_ALTP_Msk                  (0x1U << US_LONL2HDR_ALTP_Pos)                 /**< (US_LONL2HDR) LON Alternate Path Bit Mask */
#define US_LONL2HDR_PB_Pos                    (7)                                            /**< (US_LONL2HDR) LON Priority Bit Position */
#define US_LONL2HDR_PB_Msk                    (0x1U << US_LONL2HDR_PB_Pos)                   /**< (US_LONL2HDR) LON Priority Bit Mask */
#define US_LONL2HDR_Msk                       (0x000000FFUL)                                 /**< (US_LONL2HDR) Register Mask  */

/* -------- US_LONBL : (USART Offset: 0x70) (R/ 32) LON Backlog Register -------- */

typedef union
{
  struct
  {
    uint32_t LONBL:6;                   /**< bit:   0..5  LON Node Backlog Value                        */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __US_LONBL_bits_t;

#define US_LONBL_LONBL_Pos                    (0)                                            /**< (US_LONBL) LON Node Backlog Value Position */
#define US_LONBL_LONBL_Msk                    (0x3FU << US_LONBL_LONBL_Pos)                  /**< (US_LONBL) LON Node Backlog Value Mask */
#define US_LONBL_LONBL(value)                 (US_LONBL_LONBL_Msk & ((value) << US_LONBL_LONBL_Pos))
#define US_LONBL_Msk                          (0x0000003FUL)                                 /**< (US_LONBL) Register Mask  */

/* -------- US_LONB1TX : (USART Offset: 0x74) (R/W 32) LON Beta1 Tx Register -------- */

typedef union
{
  struct
  {
    uint32_t BETA1TX:24;                /**< bit:  0..23  LON Beta1 Length after Transmission           */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __US_LONB1TX_bits_t;

#define US_LONB1TX_BETA1TX_Pos                (0)                                            /**< (US_LONB1TX) LON Beta1 Length after Transmission Position */
#define US_LONB1TX_BETA1TX_Msk                (0xFFFFFFU << US_LONB1TX_BETA1TX_Pos)          /**< (US_LONB1TX) LON Beta1 Length after Transmission Mask */
#define US_LONB1TX_BETA1TX(value)             (US_LONB1TX_BETA1TX_Msk & ((value) << US_LONB1TX_BETA1TX_Pos))
#define US_LONB1TX_Msk                        (0x00FFFFFFUL)                                 /**< (US_LONB1TX) Register Mask  */

/* -------- US_LONB1RX : (USART Offset: 0x78) (R/W 32) LON Beta1 Rx Register -------- */

typedef union
{
  struct
  {
    uint32_t BETA1RX:24;                /**< bit:  0..23  LON Beta1 Length after Reception              */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __US_LONB1RX_bits_t;

#define US_LONB1RX_BETA1RX_Pos                (0)                                            /**< (US_LONB1RX) LON Beta1 Length after Reception Position */
#define US_LONB1RX_BETA1RX_Msk                (0xFFFFFFU << US_LONB1RX_BETA1RX_Pos)          /**< (US_LONB1RX) LON Beta1 Length after Reception Mask */
#define US_LONB1RX_BETA1RX(value)             (US_LONB1RX_BETA1RX_Msk & ((value) << US_LONB1RX_BETA1RX_Pos))
#define US_LONB1RX_Msk                        (0x00FFFFFFUL)                                 /**< (US_LONB1RX) Register Mask  */

/* -------- US_LONPRIO : (USART Offset: 0x7c) (R/W 32) LON Priority Register -------- */

typedef union
{
  struct
  {
    uint32_t PSNB:7;                    /**< bit:   0..6  LON Priority Slot Number                      */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t NPS:7;                     /**< bit:  8..14  LON Node Priority Slot                        */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __US_LONPRIO_bits_t;

#define US_LONPRIO_PSNB_Pos                   (0)                                            /**< (US_LONPRIO) LON Priority Slot Number Position */
#define US_LONPRIO_PSNB_Msk                   (0x7FU << US_LONPRIO_PSNB_Pos)                 /**< (US_LONPRIO) LON Priority Slot Number Mask */
#define US_LONPRIO_PSNB(value)                (US_LONPRIO_PSNB_Msk & ((value) << US_LONPRIO_PSNB_Pos))
#define US_LONPRIO_NPS_Pos                    (8)                                            /**< (US_LONPRIO) LON Node Priority Slot Position */
#define US_LONPRIO_NPS_Msk                    (0x7FU << US_LONPRIO_NPS_Pos)                  /**< (US_LONPRIO) LON Node Priority Slot Mask */
#define US_LONPRIO_NPS(value)                 (US_LONPRIO_NPS_Msk & ((value) << US_LONPRIO_NPS_Pos))
#define US_LONPRIO_Msk                        (0x00007F7FUL)                                 /**< (US_LONPRIO) Register Mask  */

/* -------- US_IDTTX : (USART Offset: 0x80) (R/W 32) LON IDT Tx Register -------- */

typedef union
{
  struct
  {
    uint32_t IDTTX:24;                  /**< bit:  0..23  LON Indeterminate Time after Transmission (comm_type = 1 mode only) */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __US_IDTTX_bits_t;

#define US_IDTTX_IDTTX_Pos                    (0)                                            /**< (US_IDTTX) LON Indeterminate Time after Transmission (comm_type = 1 mode only) Position */
#define US_IDTTX_IDTTX_Msk                    (0xFFFFFFU << US_IDTTX_IDTTX_Pos)              /**< (US_IDTTX) LON Indeterminate Time after Transmission (comm_type = 1 mode only) Mask */
#define US_IDTTX_IDTTX(value)                 (US_IDTTX_IDTTX_Msk & ((value) << US_IDTTX_IDTTX_Pos))
#define US_IDTTX_Msk                          (0x00FFFFFFUL)                                 /**< (US_IDTTX) Register Mask  */

/* -------- US_IDTRX : (USART Offset: 0x84) (R/W 32) LON IDT Rx Register -------- */

typedef union
{
  struct
  {
    uint32_t IDTRX:24;                  /**< bit:  0..23  LON Indeterminate Time after Reception (comm_type = 1 mode only) */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __US_IDTRX_bits_t;

