zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usart.h
#define US_IDTRX_IDTRX_Pos                    (0)                                            /**< (US_IDTRX) LON Indeterminate Time after Reception (comm_type = 1 mode only) Position */
#define US_IDTRX_IDTRX_Msk                    (0xFFFFFFU << US_IDTRX_IDTRX_Pos)              /**< (US_IDTRX) LON Indeterminate Time after Reception (comm_type = 1 mode only) Mask */
#define US_IDTRX_IDTRX(value)                 (US_IDTRX_IDTRX_Msk & ((value) << US_IDTRX_IDTRX_Pos))
#define US_IDTRX_Msk                          (0x00FFFFFFUL)                                 /**< (US_IDTRX) Register Mask  */

/* -------- US_ICDIFF : (USART Offset: 0x88) (R/W 32) IC DIFF Register -------- */

typedef union
{
  struct
  {
    uint32_t ICDIFF:4;                  /**< bit:   0..3  IC Differentiator Number                      */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __US_ICDIFF_bits_t;

#define US_ICDIFF_ICDIFF_Pos                  (0)                                            /**< (US_ICDIFF) IC Differentiator Number Position */
#define US_ICDIFF_ICDIFF_Msk                  (0xFU << US_ICDIFF_ICDIFF_Pos)                 /**< (US_ICDIFF) IC Differentiator Number Mask */
#define US_ICDIFF_ICDIFF(value)               (US_ICDIFF_ICDIFF_Msk & ((value) << US_ICDIFF_ICDIFF_Pos))
#define US_ICDIFF_Msk                         (0x0000000FUL)                                 /**< (US_ICDIFF) Register Mask  */

/* -------- US_WPMR : (USART Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __US_WPMR_bits_t;

#define US_WPMR_WPEN_Pos                      (0)                                            /**< (US_WPMR) Write Protection Enable Position */
#define US_WPMR_WPEN_Msk                      (0x1U << US_WPMR_WPEN_Pos)                     /**< (US_WPMR) Write Protection Enable Mask */
#define US_WPMR_WPKEY_Pos                     (8)                                            /**< (US_WPMR) Write Protection Key Position */
#define US_WPMR_WPKEY_Msk                     (0xFFFFFFU << US_WPMR_WPKEY_Pos)               /**< (US_WPMR) Write Protection Key Mask */
#define US_WPMR_WPKEY(value)                  (US_WPMR_WPKEY_Msk & ((value) << US_WPMR_WPKEY_Pos))
#define   US_WPMR_WPKEY_PASSWD_Val            (0x555341U)                                    /**< (US_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define US_WPMR_WPKEY_PASSWD                  (US_WPMR_WPKEY_PASSWD_Val << US_WPMR_WPKEY_Pos)  /**< (US_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define US_WPMR_Msk                           (0xFFFFFF01UL)                                 /**< (US_WPMR) Register Mask  */

/* -------- US_WPSR : (USART Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protection Violation Source             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __US_WPSR_bits_t;

#define US_WPSR_WPVS_Pos                      (0)                                            /**< (US_WPSR) Write Protection Violation Status Position */
#define US_WPSR_WPVS_Msk                      (0x1U << US_WPSR_WPVS_Pos)                     /**< (US_WPSR) Write Protection Violation Status Mask */
#define US_WPSR_WPVSRC_Pos                    (8)                                            /**< (US_WPSR) Write Protection Violation Source Position */
#define US_WPSR_WPVSRC_Msk                    (0xFFFFU << US_WPSR_WPVSRC_Pos)                /**< (US_WPSR) Write Protection Violation Source Mask */
#define US_WPSR_WPVSRC(value)                 (US_WPSR_WPVSRC_Msk & ((value) << US_WPSR_WPVSRC_Pos))
#define US_WPSR_Msk                           (0x00FFFF01UL)                                 /**< (US_WPSR) Register Mask  */

/** \brief USART register offsets definitions */
#define US_CR_OFFSET                 (0x00)         /**< (US_CR) Control Register Offset */
#define US_MR_OFFSET                 (0x04)         /**< (US_MR) Mode Register Offset */
#define US_IER_OFFSET                (0x08)         /**< (US_IER) Interrupt Enable Register Offset */
#define US_IDR_OFFSET                (0x0C)         /**< (US_IDR) Interrupt Disable Register Offset */
#define US_IMR_OFFSET                (0x10)         /**< (US_IMR) Interrupt Mask Register Offset */
#define US_CSR_OFFSET                (0x14)         /**< (US_CSR) Channel Status Register Offset */
#define US_RHR_OFFSET                (0x18)         /**< (US_RHR) Receive Holding Register Offset */
#define US_THR_OFFSET                (0x1C)         /**< (US_THR) Transmit Holding Register Offset */
#define US_BRGR_OFFSET               (0x20)         /**< (US_BRGR) Baud Rate Generator Register Offset */
#define US_RTOR_OFFSET               (0x24)         /**< (US_RTOR) Receiver Timeout Register Offset */
#define US_TTGR_OFFSET               (0x28)         /**< (US_TTGR) Transmitter Timeguard Register Offset */
#define US_FIDI_OFFSET               (0x40)         /**< (US_FIDI) FI DI Ratio Register Offset */
#define US_NER_OFFSET                (0x44)         /**< (US_NER) Number of Errors Register Offset */
#define US_IF_OFFSET                 (0x4C)         /**< (US_IF) IrDA Filter Register Offset */
#define US_MAN_OFFSET                (0x50)         /**< (US_MAN) Manchester Configuration Register Offset */
#define US_LINMR_OFFSET              (0x54)         /**< (US_LINMR) LIN Mode Register Offset */
#define US_LINIR_OFFSET              (0x58)         /**< (US_LINIR) LIN Identifier Register Offset */
#define US_LINBRR_OFFSET             (0x5C)         /**< (US_LINBRR) LIN Baud Rate Register Offset */
#define US_LONMR_OFFSET              (0x60)         /**< (US_LONMR) LON Mode Register Offset */
#define US_LONPR_OFFSET              (0x64)         /**< (US_LONPR) LON Preamble Register Offset */
#define US_LONDL_OFFSET              (0x68)         /**< (US_LONDL) LON Data Length Register Offset */
#define US_LONL2HDR_OFFSET           (0x6C)         /**< (US_LONL2HDR) LON L2HDR Register Offset */
#define US_LONBL_OFFSET              (0x70)         /**< (US_LONBL) LON Backlog Register Offset */
#define US_LONB1TX_OFFSET            (0x74)         /**< (US_LONB1TX) LON Beta1 Tx Register Offset */
#define US_LONB1RX_OFFSET            (0x78)         /**< (US_LONB1RX) LON Beta1 Rx Register Offset */
#define US_LONPRIO_OFFSET            (0x7C)         /**< (US_LONPRIO) LON Priority Register Offset */
#define US_IDTTX_OFFSET              (0x80)         /**< (US_IDTTX) LON IDT Tx Register Offset */
#define US_IDTRX_OFFSET              (0x84)         /**< (US_IDTRX) LON IDT Rx Register Offset */
#define US_ICDIFF_OFFSET             (0x88)         /**< (US_ICDIFF) IC DIFF Register Offset */
#define US_WPMR_OFFSET               (0xE4)         /**< (US_WPMR) Write Protection Mode Register Offset */
#define US_WPSR_OFFSET               (0xE8)         /**< (US_WPSR) Write Protection Status Register Offset */

