zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usart.h
/** \brief USART register API structure */
typedef struct
{
  __O   __US_CR_bits_t                 US_CR;         /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  __US_MR_bits_t                 US_MR;         /**< Offset: 0x04 (R/W  32) Mode Register */
  __O   __US_IER_bits_t                US_IER;        /**< Offset: 0x08 ( /W  32) Interrupt Enable Register */
  __O   __US_IDR_bits_t                US_IDR;        /**< Offset: 0x0C ( /W  32) Interrupt Disable Register */
  __I   __US_IMR_bits_t                US_IMR;        /**< Offset: 0x10 (R/   32) Interrupt Mask Register */
  __I   __US_CSR_bits_t                US_CSR;        /**< Offset: 0x14 (R/   32) Channel Status Register */
  __I   __US_RHR_bits_t                US_RHR;        /**< Offset: 0x18 (R/   32) Receive Holding Register */
  __O   __US_THR_bits_t                US_THR;        /**< Offset: 0x1C ( /W  32) Transmit Holding Register */
  __IO  __US_BRGR_bits_t               US_BRGR;       /**< Offset: 0x20 (R/W  32) Baud Rate Generator Register */
  __IO  __US_RTOR_bits_t               US_RTOR;       /**< Offset: 0x24 (R/W  32) Receiver Timeout Register */
  __IO  __US_TTGR_bits_t               US_TTGR;       /**< Offset: 0x28 (R/W  32) Transmitter Timeguard Register */
  __I   uint8_t                        Reserved1[0x14];
  __IO  __US_FIDI_bits_t               US_FIDI;       /**< Offset: 0x40 (R/W  32) FI DI Ratio Register */
  __I   __US_NER_bits_t                US_NER;        /**< Offset: 0x44 (R/   32) Number of Errors Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  __US_IF_bits_t                 US_IF;         /**< Offset: 0x4C (R/W  32) IrDA Filter Register */
  __IO  __US_MAN_bits_t                US_MAN;        /**< Offset: 0x50 (R/W  32) Manchester Configuration Register */
  __IO  __US_LINMR_bits_t              US_LINMR;      /**< Offset: 0x54 (R/W  32) LIN Mode Register */
  __IO  __US_LINIR_bits_t              US_LINIR;      /**< Offset: 0x58 (R/W  32) LIN Identifier Register */
  __I   __US_LINBRR_bits_t             US_LINBRR;     /**< Offset: 0x5C (R/   32) LIN Baud Rate Register */
  __IO  __US_LONMR_bits_t              US_LONMR;      /**< Offset: 0x60 (R/W  32) LON Mode Register */
  __IO  __US_LONPR_bits_t              US_LONPR;      /**< Offset: 0x64 (R/W  32) LON Preamble Register */
  __IO  __US_LONDL_bits_t              US_LONDL;      /**< Offset: 0x68 (R/W  32) LON Data Length Register */
  __IO  __US_LONL2HDR_bits_t           US_LONL2HDR;   /**< Offset: 0x6C (R/W  32) LON L2HDR Register */
  __I   __US_LONBL_bits_t              US_LONBL;      /**< Offset: 0x70 (R/   32) LON Backlog Register */
  __IO  __US_LONB1TX_bits_t            US_LONB1TX;    /**< Offset: 0x74 (R/W  32) LON Beta1 Tx Register */
  __IO  __US_LONB1RX_bits_t            US_LONB1RX;    /**< Offset: 0x78 (R/W  32) LON Beta1 Rx Register */
  __IO  __US_LONPRIO_bits_t            US_LONPRIO;    /**< Offset: 0x7C (R/W  32) LON Priority Register */
  __IO  __US_IDTTX_bits_t              US_IDTTX;      /**< Offset: 0x80 (R/W  32) LON IDT Tx Register */
  __IO  __US_IDTRX_bits_t              US_IDTRX;      /**< Offset: 0x84 (R/W  32) LON IDT Rx Register */
  __IO  __US_ICDIFF_bits_t             US_ICDIFF;     /**< Offset: 0x88 (R/W  32) IC DIFF Register */
  __I   uint8_t                        Reserved3[0x58];
  __IO  __US_WPMR_bits_t               US_WPMR;       /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   __US_WPSR_bits_t               US_WPSR;       /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} usart_registers_t;
/** @}  end of Universal Synchronous Asynchronous Receiver Transmitter */

#endif /* _PIC32CZ_CA70_USART_COMPONENT_H_ */
